[{"title":" Cambodian helicopter spotted crashed on mountain 17 days after being lost. No survivors seen","publishedAt":"Mon, 29 Jul 2024 10:53:58 -0400","description":"Cambodia\u0026rsquo;s Defense Ministry and state media reports say that the wreckage of a Cambodian military helicopter that went missing more than two weeks ago with two pilots aboard has been spotted on a mountaintop","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/cambodian-helicopter-spotted-crashed-mountain-17-days-after-112369811"},{"title":" Pakistan arrests top leader of radical party on charge of ordering the killing of the chief justice","publishedAt":"Mon, 29 Jul 2024 10:46:37 -0400","description":"Officials say Pakistan\u0026rsquo;s police have arrested the deputy chief at a radical Islamist party on charges of ordering the killing of the chief justice over his alleged support to the minority Ahmadi community","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/pakistan-arrests-top-leader-radical-party-charge-ordering-112366151"},{"title":" Israeli military detains 9 soldiers over alleged abuse of a detainee at shadowy military facility","publishedAt":"Mon, 29 Jul 2024 10:29:51 -0400","description":"The Israeli military says it is holding nine soldiers for questioning following allegations of \u0026ldquo;substantial abuse\u0026rdquo; of a detainee at a shadowy facility where Israel has held Palestinian prisoners throughout the war in Gaza","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/israeli-military-detains-9-soldiers-alleged-abuse-detainee-112365876"},{"title":" A diplomatic spat erupts between Hungary and Poland over conflicting views on Russia","publishedAt":"Mon, 29 Jul 2024 10:46:09 -0400","description":"A diplomatic spat has erupted between Poland and Hungary that lays bare the deep tensions between two nations \u0026mdash; both allies in NATO and the European Union \u0026mdash; with dramatically different approaches to Russia at a time of war in Ukraine","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/diplomatic-spat-erupts-hungary-poland-conflicting-views-russia-112365875"},{"title":" Greece announces nationwide restrictions to combat 'goat plague' outbreak","publishedAt":"Mon, 29 Jul 2024 09:04:29 -0400","description":"Authorities in Greece have ordered nationwide restrictions on goat and sheep to combat a deadly viral outbreak","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/greece-announces-nationwide-restrictions-combat-goat-plague-outbreak-112365625"},{"title":" Former South Africa president Zuma is expelled by his former ANC party after forming a challenger","publishedAt":"Mon, 29 Jul 2024 08:54:26 -0400","description":"Former South African president Jacob Zuma has been expelled by his former African National Congress party after he formed a new political party that contested the country\u0026rsquo;s recent elections","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/former-south-africa-president-zuma-expelled-former-anc-112365110"},{"title":" Bloodied children flee a stabbing attack in England. 8 people are hurt and a man is arrested","publishedAt":"Mon, 29 Jul 2024 11:02:19 -0400","description":"Emergency services say at least eight people, some of them children, have been injured in stabbings in northwest England","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/man-arrested-after-reports-stabbing-multiple-casualties-northwest-112364524"},{"title":" China's Xi calls for cooperation with Italy, evoking ancient 'Silk Road'","publishedAt":"Mon, 29 Jul 2024 08:22:31 -0400","description":"Chinese President Xi Jinping called for further cooperation with Italy on Monday at a meeting with Italian Prime Minister Giorgia Meloni, saying the two countries were the ends of the historical Silk Road trade route","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/chinas-xi-calls-cooperation-italy-evoking-ancient-silk-112364105"},{"title":" Turkish official accuses Israel of targeting Erdogan after he seemed to threaten to invade over Gaza","publishedAt":"Mon, 29 Jul 2024 08:13:52 -0400","description":"A senior Turkish official accuses the Israeli government of trying to hide war crimes by targeting President Recep Tayyip Erdogan after he seemingly threatened to invade Israel","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/turkish-official-accuses-israel-targeting-erdogan-after-threaten-112363761"},{"title":" High Court judge in the UK upholds the government ban on puberty blockers","publishedAt":"Mon, 29 Jul 2024 08:45:50 -0400","description":"A High Court judge has upheld the British government\u0026rsquo;s emergency ban on puberty blockers","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/high-court-judge-uk-upholds-government-ban-puberty-112363277"},{"title":" Australian inquiry will hear evidence that Christian extremists killed 3 in an act of terrorism","publishedAt":"Mon, 29 Jul 2024 08:30:17 -0400","description":"An expert will tell an inquiry that three Christian extremists killed two police officers and a bystander and wounded a third police officer in an ambush on a rural Australian property in 2022 in an act of terrorism","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/australian-inquiry-hear-evidence-christian-extremists-killed-3-112362912"},{"title":" North Korean officials seek medicines for Kim's obesity-related health problems, Seoul says","publishedAt":"Mon, 29 Jul 2024 11:01:59 -0400","description":"South Korea's spy agency says North Korean leader Kim Jong Un has regained weight and has obesity-related health problems including high blood pressure and diabetes","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/north-korean-officials-medicines-kims-obesity-related-health-112362929"},{"title":" Skyrocketing power bills draw protests near Pakistan's capital","publishedAt":"Mon, 29 Jul 2024 10:54:47 -0400","description":"Protests over skyrocketing power bills have shut down a major road into Pakistan\u0026rsquo;s capital as some 3,000 supporters of a major Islamist party continue a sit-in despite pouring monsoon rains","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/skyrocketing-power-bills-draw-protests-pakistans-capital-112361805"},{"title":" 1 person dies as Latvia and Lithuania are hit by a powerful storm","publishedAt":"Mon, 29 Jul 2024 10:46:53 -0400","description":"One person has died and some 200,000 households have been left without electricity in Lithuania and neighboring Latvia as strong storm winds and heavy rain pounded the two Baltic nations overnight","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/1-person-dies-latvia-lithuania-hit-powerful-storm-112361335"},{"title":" Vandalism hits communication lines in France during Paris Olympics","publishedAt":"Mon, 29 Jul 2024 10:22:25 -0400","description":"The French government says multiple telecommunications lines have been hit by acts of vandalism, affecting fiber lines and fixed and mobile phone lines as cities around France are hosting events for the 2024 Paris Olympics","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/vandalism-hits-communication-lines-france-paris-olympics-112361236"},{"title":" French authorities say vandalism has hit multiple telecommunications lines as France hosts 2024 Olympics","publishedAt":"Mon, 29 Jul 2024 06:14:00 -0400","description":"French authorities say vandalism has hit multiple telecommunications lines as France hosts 2024 Olympics","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/french-authorities-vandalism-hit-multiple-telecommunications-lines-france-112361067"},{"title":" Ukrainian troops say Russia's front-line push has driven them out of two more eastern villages","publishedAt":"Mon, 29 Jul 2024 10:06:25 -0400","description":"Ukrainian soldiers say Russian forces have overrun two front-line villages, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses in Ukraine\u0026rsquo;s eastern Donetsk region","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/russia-stopped-drone-barrage-soil-pushes-breakthrough-ukraine-112361069"},{"title":" Rights group says sexual violence is rampant in Sudan's conflict, calls for international protection","publishedAt":"Mon, 29 Jul 2024 09:42:30 -0400","description":"Human Rights Watch is accusing the paramilitary group fighting against the military in Sudan\u0026rsquo;s civil war of rampant sexual violence against women, including gang rape and forced marriages of girls","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/rights-group-sexual-violence-rampant-sudans-civil-war-112360956"},{"title":" Israel-Hamas war latest: US cautions Israel over escalation with Hezbollah after weekend attack","publishedAt":"Mon, 29 Jul 2024 10:46:29 -0400","description":"The United States is cautioning Israel about escalation with the Iranian-backed Hezbollah as Israel weighs its response to a rocket attack from Lebanon over the weekend that killed 12 youths in the Israel-controlled Golan Heights","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/israel-hamas-war-latest-israeli-strike-killed-2-112360860"},{"title":" 6 UK lawmakers are running to lead the Conservative Party after its crushing election defeat","publishedAt":"Mon, 29 Jul 2024 06:54:24 -0400","description":"Six British lawmakers have announced they are running to lead the defeated Conservative Party","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/6-uk-lawmakers-running-lead-conservative-party-after-112360674"},{"title":" Historic UNESCO world heritage park in Germany grapples with dying trees as climate change kicks in","publishedAt":"Mon, 29 Jul 2024 06:38:16 -0400","description":"The avenues, monuments and gardens in the park surrounding Sanssouci Palace, a sprawling green oasis in the heart of the German city of Potsdam and a UNESCO world heritage site, look as magnificent as ever","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/germanys-sanssouci-park-seeks-solutions-trees-struggle-climate-112360488"},{"title":" Indonesian leader starts working in new capital despite construction work and lack of facilities","publishedAt":"Mon, 29 Jul 2024 05:26:30 -0400","description":"Indonesian President Joko Widodo, who intends to spend his last few months of his presidency in the country\u0026rsquo;s ambitious new capital, has begun to work from the new presidential palace there, despite the continuing construction work and lack of first-cl...","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/indonesian-leader-starts-working-new-capital-despite-construction-112360394"},{"title":" Venezuela's capital is eerily calm after vote in which Maduro and opposition both claimed victory","publishedAt":"Mon, 29 Jul 2024 10:30:18 -0400","description":"An eerie calm has enveloped Venezuela\u0026rsquo;s capital, a day after the country\u0026rsquo;s opposition and entrenched incumbent Nicol\u0026aacute;s Maduro both claimed victory in the presidential election","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/maduro-locked-standoff-opponents-side-claims-victory-presidential-112360114"},{"title":" The Galapagos Islands and their unique creatures are at risk from warming waters","publishedAt":"Mon, 29 Jul 2024 02:54:30 -0400","description":"The wondrous Galapagos Islands and its many creatures have always been sensitive to changes in ocean temperatures","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/galapagos-islands-unique-creatures-risk-warming-waters-112359910"},{"title":" Yazidis uprooted by Islamic State onslaught struggle to find stable homes a decade on","publishedAt":"Mon, 29 Jul 2024 02:54:18 -0400","description":"Ten years ago, Islamic State militants launched an onslaught on villages and towns of the Yazidi religious community in northern Iraq","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/ten-years-yazidis-uprooted-islamic-state-onslaught-struggle-112359912"},{"title":"North Korean officials looking for medicines for Kim's obesity-related health problems, Seoul says\n","publishedAt":"Mon, 29 Jul 2024 07:06:29 -0400","description":"North Korean leader Kim Jong Un has regained weight and is suffering from obesity-related health problems including high blood pressure and diabetes, and his officials are looking for new medicines abroad to treat them, South Korea's spy agency told lawmakers on Monday.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/29/seoul-says-north-korean-officials-looking-for-medi/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Rights group says sexual violence is rampant in Sudan's civil war\n","publishedAt":"Mon, 29 Jul 2024 05:13:27 -0400","description":"An international rights group on Monday accused a paramilitary group in war-torn Sudan of sexual violence against women, including rape, gang rape, and forced and child marriage. A smaller number of incidents were also attributed to the military, it said.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/29/rights-group-accuses-paramilitary-group-in-war-tor/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Israeli strike killed 2 people in southern Lebanon, Lebanese media say\n","publishedAt":"Mon, 29 Jul 2024 04:58:56 -0400","description":"Israeli strikes killed two people and injured three others in southern Lebanon early Monday, Lebanon's state-run news agency said.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/29/israeli-strike-killed-2-people-in-southern-lebanon/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"6 U.K. lawmakers are running to lead the Conservative Party after its crushing election defeat\n","publishedAt":"Mon, 29 Jul 2024 04:57:22 -0400","description":"Six British lawmakers have announced they are running to lead the defeated Conservative Party, ahead of a Monday deadline, in a contest that will decide whether the opposition party tacks to the right or steers toward the political center ground.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/29/six-uk-lawmakers-are-running-to-lead-conservative-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Blinken and envoys from Japan, Australia and India work to improve maritime safety in Asia-Pacific\n","publishedAt":"Mon, 29 Jul 2024 03:40:32 -0400","description":"Top diplomats from Japan, the U.S., Australia and India meeting Monday in Tokyo compiled a set of measures to reinforce maritime safety and cybersecurity and to support other Asia-Pacific countries in improving their defenses during growing tensions in the regional seas.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/29/blinken-and-envoys-from-australia-japan-and-india-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Maduro locked in standoff with opponents as each side claims victory in presidential elections\n","publishedAt":"Mon, 29 Jul 2024 03:35:18 -0400","description":"Venezuela's opposition and President Nicolas Maduro's government were locked in a high-stakes standoff after each side claimed victory in Sunday's presidential vote, which millions in the long-suffering nation saw as their best shot to end 25 years of single-party rule.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/29/nicolas-maduro-locked-in-standoff-with-opponents-e/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Thousands in Ukraine honor soldiers killed in blast and urge government to get prisoners freed\n","publishedAt":"Sun, 28 Jul 2024 13:23:54 -0400","description":"Ukrainians urged their government to do more to get Russia to release prisoners of war, voicing their anger on Sunday at a ceremony commemorating the second anniversary of an explosion that killed more than 50.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/ukrainians-honor-soldiers-killed-in-blast-and-urge/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"U.S. intelligence community discovered TikTok censored for China, says Justice Department filing\n","publishedAt":"Sun, 28 Jul 2024 13:16:35 -0400","description":"The U.S. intelligence community determined that TikTok censored speech on behalf of the Chinese government, according to a Justice Department court filing.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/us-intelligence-community-discovered-tiktok-censor/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Venezuelan election could lead to a seismic shift in politics or give President Maduro 6 more years\n","publishedAt":"Sun, 28 Jul 2024 10:09:51 -0400","description":"Venezuelans are voting Sunday in a presidential election whose outcome will either lead to a seismic shift in politics or extend by six more years the policies that caused the world's worst peacetime economic collapse.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/election-in-venezuelan-could-lead-to-seismic-shift/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"France renews vow to defend freedom of navigation as it showcases fighter jets in the Philippines\n","publishedAt":"Sun, 28 Jul 2024 09:35:13 -0400","description":"France renewed a commitment to help defend freedom of navigation and overflight in the Asia-Pacific Sunday and said that its supersonic fighter jets - a pair of which landed for the first time in the Philippines - and advance military power would enable it to respond rapidly to any humanitarian or security crisis in the region.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/as-it-showcases-fighter-jets-in-philippines-france/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Italy and China sign a 3-year action plan as Italian leader Meloni tries to reset relations\n","publishedAt":"Sun, 28 Jul 2024 09:27:16 -0400","description":"Italy and China signed a three-year action plan on Sunday to implement past agreements and experiment with new forms of cooperation, Italy's Prime Minister Giorgia Meloni said on an official visit to the Chinese capital.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/china-italy-sign-3-year-action-plan-as-italian-pm-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"A strike from Lebanon killed 12 youths. Could that spark war between Israel and Hezbollah?\n","publishedAt":"Sun, 28 Jul 2024 09:17:20 -0400","description":"The Middle East was bracing for a potential flare-up in violence on Sunday after Israeli authorities said a rocket from Lebanon struck a soccer field in the Israeli-controlled Golan Heights, killing 12 children and teens in what the military said was the deadliest attack on civilians since Oct. 7. The strike raised fears of a broader regional war between Israel and Hezbollah, which denied a role in the attack.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/lebanons-strike-killed-12-youths-could-that-spark-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Russia's Putin vows 'mirror measures' in response to U.S. missiles in Germany\n","publishedAt":"Sun, 28 Jul 2024 08:25:00 -0400","description":"Russia may deploy new strike weapons in response to the planned U.S. stationing of longer-range and hypersonic missiles in Germany, Russian President Vladimir Putin said on Sunday.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/vladimir-putin-vows-mirror-measures-in-response-to/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Mudslide kills 15 people near tourist site in China as rains from tropical storm Gaemi drench region\n","publishedAt":"Sun, 28 Jul 2024 08:24:31 -0400","description":"Fifteen people were killed after a mudslide hit a homestay house in a tourist area in southeastern China on Sunday as heavy rains from what remained of a tropical storm drenched the region, state media said.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/15-people-near-tourist-site-in-china-killed-as-rai/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"U.S.-Japan security talks focus on bolstering military cooperation, underscores threat from China\n","publishedAt":"Sun, 28 Jul 2024 08:21:45 -0400","description":"Japanese and U.S. defense chiefs and top diplomats agreed to further bolster their military cooperation by upgrading the command and control of U.S. forces in the East Asian country and strengthening American-licensed missile production there, describing the rising threat from China as \"the greatest strategic challenge.\"\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/security-talks-between-us-japan-focus-on-boosting-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Lawmakers from 6 countries say Beijing is pressuring them not to attend summit in Taiwan\n","publishedAt":"Sun, 28 Jul 2024 07:16:51 -0400","description":"Lawmakers from at least six countries say Chinese diplomats are pressuring them not to attend a China-focused summit in Taiwan, in what they describe as efforts to isolate the self-governed island.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/legislators-from-6-countries-say-beijing-is-pressu/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Russia-U.S. divide was on display during Moscow's monthlong presidency of the U.N. Security Council\n","publishedAt":"Sun, 28 Jul 2024 07:08:43 -0400","description":"Whether it's Gaza, Ukraine, Syria or a new world order, it's been Russia versus the United States and the West during Moscow's presidency of the Security Council this month, with the growing divide on vivid display.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/divide-between-russia-us-on-display-during-moscows/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Two meteor showers will flash across the sky around the same time in late July\n","publishedAt":"Sun, 28 Jul 2024 07:05:04 -0400","description":"Get ready for a meteor shower doubleheader.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/southern-delta-aquariid-alpha-capricorn-meteor-sho/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"U.K. 'broke and broken,' new government says as it prepares to tackle shortfall in public finances\n","publishedAt":"Sun, 28 Jul 2024 06:59:09 -0400","description":"Britain's new left-leaning government said Sunday that the nation is \"broke and broken,\" blaming the situation on its predecessors ahead of a major speech on the state of the public finances that is widely expected to lay the groundwork for higher taxes.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/new-government-says-uk-broke-and-broken-as-it-prep/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Ex-diplomat, political newcomer, grandpa. That's Edmundo Gonzalez, Venezuela's Maduro rival\n","publishedAt":"Sun, 28 Jul 2024 01:46:20 -0400","description":"The past two months were unlike anything Edmundo Gonzalez Urrutia had ever experienced: He gave political speeches, shook people's hands and waved from the top of a truck moving through cheering crowds gathered across Venezuela. He also shed the title of ambassador for that of presidential candidate.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/28/edmundo-gonzalez-is-venezuelas-nicolas-maduro-riva/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Junior doctors offered 22% pay rise in deal to end strike action","publishedAt":"Mon, 29 Jul 2024 12:11:19 GMT","description":"If accepted, it would spell an end to a long-running dispute which has seen the cancellation of hundreds of thousands of appointments.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cjqe82lk5g5o"},{"title":"Far-right campaigner Tommy Robinson leaves UK on eve of court case","publishedAt":"Mon, 29 Jul 2024 12:29:42 GMT","description":"A senior judge issues an arrest warrant for him after he boarded a Eurotunnel train on Sunday night.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cjerxd00rlxo"},{"title":"Jeremy Bowen: Golan attack leaves border war's unspoken rules in tatters","publishedAt":"Mon, 29 Jul 2024 13:15:27 GMT","description":"How Israel retaliates could determine whether the conflict stays limited or explodes into something much worse.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c6p2j85k8dro"},{"title":"Health alert for England as temperatures of 32C forecast","publishedAt":"Mon, 29 Jul 2024 11:16:20 GMT","description":"The hottest day of the year in the UK could be recorded on Tuesday before thunderstorms roll in","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c1vd1d9r1wxo"},{"title":"Prison officer admits sex with inmate in cell","publishedAt":"Mon, 29 Jul 2024 14:00:31 GMT","description":"Linda De Sousa Abreu, 30, was charged after a video of the incident went viral on social media.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cd1948exzk9o"},{"title":"Man arrested over suspected French railway vandalism","publishedAt":"Mon, 29 Jul 2024 10:36:02 GMT","description":"Police sources told local media the 28-year-old was found acting suspiciously near a railway site. ","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c903431qejqo"},{"title":"Six-week abortion ban takes effect in Iowa","publishedAt":"Mon, 29 Jul 2024 15:01:06 GMT","description":"More than one in three US women now live in a state that has restricted abortion access since 2022.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/ckvgwdx3v77o"},{"title":"Puberty blockers ban is lawful, says High Court","publishedAt":"Mon, 29 Jul 2024 12:53:25 GMT","description":"Ban on puberty blockers introduced by last government using emergency legislation was lawful, High Court rules.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c4ng3gz99nwo"},{"title":"Which medals are up for grabs today?","publishedAt":"Mon, 29 Jul 2024 07:12:42 GMT","description":"Your day-by-day guide to what is happening when - and who to watch out for - at the Paris 2024 Olympics.","Publisher":"bbc","url":"https://www.bbc.com/sport/articles/c1dmp9krz91o"},{"title":"GB win first gold at Paris Games in team eventing ","publishedAt":"Mon, 29 Jul 2024 11:40:34 GMT","description":"Great Britain retain their Olympic team eventing title to win the nation's first gold medal at the Paris 2024 Games, before Laura Collett wins individual bronze.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/cy68zxgdn4do"},{"title":"Watch Daley and Williams seal silver medal","publishedAt":"Mon, 29 Jul 2024 10:07:08 GMT","description":"Watch as Tom Daley and Noah Williams seal a silver medal at the Paris 2024 Olympics. \n\n\n","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/videos/cn05n56p31qo"},{"title":"Who are Team GB's medal winners so far?","publishedAt":"Mon, 29 Jul 2024 11:29:40 GMT","description":"Read about and watch the medal moments for Team GB at the Paris Olympics 2024.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/c3gdyj88d30o"},{"title":"Organisers confident triathlon will go ahead despite pollution concerns","publishedAt":"Mon, 29 Jul 2024 12:36:34 GMT","description":"Paris 2024 organisers are confident the Olympic triathlon will go ahead as scheduled despite concerns over pollution in the River Seine.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/c16j4l9zl8go"},{"title":"'I feel like I've still won,' says tearful Peaty","publishedAt":"Sun, 28 Jul 2024 22:48:21 GMT","description":"Adam Peaty is denied in his bid for gold but, on a night of pure Olympic emotion, departs content after the dark places he has been.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/c728glxp892o"},{"title":"How to follow Paris 2024 Olympics across the BBC","publishedAt":"Fri, 26 Jul 2024 08:49:48 GMT","description":"BBC TV channels and times, plus radio and online coverage details for the 2024 Olympic Games in Paris.","Publisher":"bbc","url":"https://www.bbc.com/sport/articles/c0krn1k4wlzo"},{"title":"How to follow the Games across the BBC","publishedAt":"Fri, 26 Jul 2024 08:49:48 GMT","description":"BBC TV channels and times, plus radio and online coverage details for the 2024 Olympic Games in Paris.","Publisher":"bbc","url":"https://www.bbc.com/sport/articles/c0krn1k4wlzo"},{"title":"Five takeaways from day two of Paris Olympics 2024","publishedAt":"Sun, 28 Jul 2024 20:40:27 GMT","description":"An Adam Peaty near-miss, Andy Murray comeback and Simone Biles star return, plus a GB bronze, are among the highlights.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/czvxqy88l5jo"},{"title":"Commentator axed over sexist remark","publishedAt":"Mon, 29 Jul 2024 15:02:12 GMT","description":"Bob Ballard was referencing the Australian women's swimming team who had won gold in a freestyle relay.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cprq880yz0xo"},{"title":"Parisians grumbled about the Olympics – but they’re warming to it","publishedAt":"Sun, 28 Jul 2024 17:07:24 GMT","description":"The vibrant opening ceremony and a flurry of French medals seem to have put paid to pre-Games gloom.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/ckmg3lyd14do"},{"title":"Choreographed celebrations in Venezuela as Maduro claims win","publishedAt":"Mon, 29 Jul 2024 13:55:00 GMT","description":"Maduro's supporters are jubilant but the opposition is demanding proof of the voting numbers.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c1dmv9jlvj1o"},{"title":"Timing, luck or talent - what makes a billionaire?","publishedAt":"Sun, 28 Jul 2024 23:23:27 GMT","description":"Are billionaires good or bad for society - or simply very very rich? The BBC's Simon Jack investigates. ","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cw4yej2n184o"},{"title":"'Not every Norwegian feels guilty but many do'","publishedAt":"Sun, 28 Jul 2024 23:01:02 GMT","description":"Norway's oil wealth has made it one of the world's richest countries, but some feel bad about it.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cz5r2mk18k1o"},{"title":"A day in the life of a weather forecaster","publishedAt":"Mon, 29 Jul 2024 07:56:06 GMT","description":"Sarah Keith-Lucas takes us through a typical working day at the BBC Weather Centre in London.","Publisher":"bbc","url":"https://www.bbc.com/weather/videos/ckmgppzgp3ro"},{"title":"How do hot weather health alerts work?","publishedAt":"Mon, 29 Jul 2024 13:49:19 GMT","description":"The weather alert service warns the public when high or low temperatures could damage their health.","Publisher":"bbc","url":"https://www.bbc.co.uk/news/health-65843463"},{"title":"Download now","publishedAt":"Tue, 13 Jun 2023 10:25:22 GMT","description":"Top stories, breaking news, live reporting, and follow news topics that match your interests","Publisher":"bbc","url":"https://www.bbc.co.uk/news/10628994"},{"title":"Peak District beauty spot sees mass brawl","publishedAt":"Mon, 29 Jul 2024 12:52:53 GMT","description":"Mobile phone footage shows sticks being waved and punches thrown at the stepping stones in Dovedale.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cn38n8pegypo"},{"title":"Dog walker dies four days after attack","publishedAt":"Sun, 28 Jul 2024 21:48:13 GMT","description":"Anita Rose dies in hospital four days after being found unconscious on a track in her village.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cp9vwxlddy9o"},{"title":"Thousands hit by N Korea floods as Kim calls 'emergency'","publishedAt":"Mon, 29 Jul 2024 07:42:31 GMT","description":"A photograph taken by state media shows Kim Jong Un travelling through a flooded area in a Lexus.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c84jnn9llgzo"},{"title":"Badenoch announces Tory leader bid as Braverman says she will not run","publishedAt":"Mon, 29 Jul 2024 07:08:26 GMT","description":"The 44-year-old promises to return her party to \"first principles\" including a focus on sovereignty.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cw0yr7pyzneo"},{"title":"Border zone at Dover to be expanded ahead of new EU rules","publishedAt":"Mon, 29 Jul 2024 08:28:35 GMT","description":"The port plans to change the location of passport control for passengers arriving to board ferries.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cv2gx2p78gro"},{"title":"Deadpool \u0026 Wolverine beats box office record ","publishedAt":"Mon, 29 Jul 2024 09:57:20 GMT","description":"Ryan Reynolds says the film's success is \"kind of hard to process\".","Publisher":"bbc","url":"https://www.bbc.com/news/articles/ckkgvkyely9o"},{"title":"Can You Buy The White Hou$e?","publishedAt":"Fri, 26 Jul 2024 10:30:00 GMT","description":"The role of donations in presidential campaigns.","Publisher":"bbc","url":"https://www.bbc.co.uk/sounds/play/m0021bhr"},{"title":"Holiday Hacks: Cut the Cost","publishedAt":"Sat, 27 Jul 2024 05:00:00 GMT","description":"Our travel experts top tips on how to make your money go further while on holiday.","Publisher":"bbc","url":"https://www.bbc.co.uk/iplayer/episode/m0021rmd"},{"title":"Peaty tests positive for Covid after winning silver","publishedAt":"Mon, 29 Jul 2024 15:02:40 GMT","description":"Adam Peaty tests positive for Covid-19 a day after winning silver for Team GB in the 100m breaststroke.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/crgl6n0x39eo"},{"title":"Daley wins superb fifth Olympic medal with Williams","publishedAt":"Mon, 29 Jul 2024 10:02:50 GMT","description":"Tom Daley wins his fifth Olympic medal with a superb silver alongside Noah Williams in the men's synchronised 10m platform in Paris.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/c4ngkgq10vxo"},{"title":"Paris organisers confident triathlon will go ahead","publishedAt":"Mon, 29 Jul 2024 12:36:34 GMT","description":"Paris 2024 organisers are confident the Olympic triathlon will go ahead as scheduled despite concerns over pollution in the River Seine.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/c16j4l9zl8go"},{"title":"Top five stories from day three of Paris Olympics 2024","publishedAt":"Mon, 29 Jul 2024 14:19:44 GMT","description":"Great Britain win their first gold medals of the Paris Olympics on day three of the 2024 Games.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/c97d87wegd4o"},{"title":"Djokovic beats Nadal to keep Olympic dream going","publishedAt":"Mon, 29 Jul 2024 14:30:37 GMT","description":"Novak Djokovic outclasses long-time rival Rafael Nadal to win their Olympic second-round match and continue his bid to land an elusive gold medal.","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/articles/crg504g6gm0o"},{"title":"'It's so special' says Daley as his children watch their first Olympics ","publishedAt":"Mon, 29 Jul 2024 11:06:40 GMT","description":"Watch as Great Britain's Tom Daley and Noah Williams speak to the BBC after they received their silver Olympic medal in the men's synchronised 10m platform at the Paris 2024 Olympics. ","Publisher":"bbc","url":"https://www.bbc.com/sport/olympics/videos/c4ngqlpqz7zo"},{"title":"Eight stabbed and man held in 'major incident'","publishedAt":"Mon, 29 Jul 2024 14:48:20 GMT","description":"Eight have been taken to hospitals including Alder Hey declares a \"major incident\".","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cql8j2j0304o"},{"title":"DUP to meet PSNI over Armagh victory police car footage","publishedAt":"Mon, 29 Jul 2024 13:14:32 GMT","description":"Police say an internal investigation has been launched into footage of officers taking part in celebrations.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/czrjl2d4grgo"},{"title":"Police road safety appeal after four die in motorbike crashes","publishedAt":"Mon, 29 Jul 2024 13:15:57 GMT","description":"Three riders died in a crash in the Scottish Borders, and a woman died a short time later in Argyll. ","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cy9459l9dd9o"},{"title":"Venezuela's president, opposition rival both claim election victory","publishedAt":"2024-07-29T13:34:56Z","description":"Venezuela's president, opposition rival both claim election victoryWorld\n\n","Publisher":"usatoday","url":"/story/news/world/2024/07/29/venezuelas-president-maduro-2024-election/74585323007/"},{"title":"'Stop the killings': Vigils honor Sonya Massey as outrage builds","publishedAt":"2024-07-29T02:26:13Z","description":"'Stop the killings': Vigils honor Sonya Massey as outrage buildsNation\n\n","Publisher":"usatoday","url":"/story/news/nation/2024/07/28/sonya-massey-shooting-vigils-updates/74578113007/"},{"title":"Who's behind Project 2025? Some have racist writings, background","publishedAt":"2024-07-29T10:08:33Z","description":"Who's behind Project 2025? Some have racist writings, backgroundInvestigations\n\n","Publisher":"usatoday","url":"/story/news/investigations/2024/07/29/project-2025-racist-writing/74567007007/"},{"title":"Trump proposes death penalty for drug dealers: Agenda47 on crime","publishedAt":"2024-07-29T09:13:46Z","description":"Trump proposes death penalty for drug dealers: Agenda47 on crimeElections\n\n","Publisher":"usatoday","url":"/story/news/politics/elections/2024/07/29/trump-agenda47-crime-policy-proposal/74517501007/"},{"title":"Kamala Harris voters in Georgia 'not going back' on abortion","publishedAt":"2024-07-29T12:50:44Z","description":"Kamala Harris voters in Georgia 'not going back' on abortionElections\n\n","Publisher":"usatoday","url":"/story/news/politics/elections/2024/07/29/georgia-kamala-harris-abortion-top-concern/74579644007/"},{"title":"Lady Gaga introduces Michael Polansky as her 'fiancé' in Paris","publishedAt":"2024-07-29T12:18:42Z","description":"Lady Gaga introduces Michael Polansky as her 'fiancé' in ParisCelebrities\n\n","Publisher":"usatoday","url":"/story/entertainment/celebrities/2024/07/29/lady-gaga-michael-polansky-fiance-olympics/74584273007/"},{"title":"Disease Jimmy Carter sought to eradicate is nearly gone.","publishedAt":"2024-07-29T09:14:57Z","description":"Disease Jimmy Carter sought to eradicate is nearly gone.Health\n\n","Publisher":"usatoday","url":"/story/news/health/2024/07/29/jimmy-carter-guinea-worm-disease/74540084007/"},{"title":"Looking for that cute guy you just passed? He's probably on TikTok","publishedAt":"2024-07-29T14:59:21Z","description":"Looking for that cute guy you just passed? He's probably on TikTokHealth and Wellness\n\n","Publisher":"usatoday","url":"/story/life/health-wellness/2024/07/29/tiktok-gen-z-missed-connections-rejection-social-anxiety/74530565007/"},{"title":"Olympic athletes share heartbreak and comeback after ACL injury","publishedAt":"2024-07-29T09:14:17Z","description":"Olympic athletes share heartbreak and comeback after ACL injuryHealth\n\n","Publisher":"usatoday","url":"/story/news/health/2024/07/29/olympic-athletes-acl-injury-comeback/74523316007/"},{"title":"United Airlines flight diverted after report of crew vomiting","publishedAt":"2024-07-29T13:39:04Z","description":"United Airlines flight diverted after report of crew vomitingAirline News\n\n","Publisher":"usatoday","url":"/story/travel/airline-news/2024/07/29/united-airlines-flight-2477-diverted/74584850007/"},{"title":"Exclusive: Patrick Mahomes opens up on his pay after QB megadeals","publishedAt":"2024-07-29T11:05:04Z","description":"Exclusive: Patrick Mahomes opens up on his pay after QB megadealsJarrett Bell\n\n","Publisher":"usatoday","url":"/story/sports/nfl/columnist/bell/2024/07/29/patrick-mahomes-salary-contract-chiefs-quarterback/74583719007/"}]