[
  {
    "title": "Container ship that struck Baltimore bridge will be removed from the site 'within days,' Maryland governor says",
    "publishedAt": "2024-05-19T14:06:47Z",
    "description": "Ship that struck Francis Scott Key Bridge in Baltimore will be removed \"within days,\" Maryland Gov. Wes Moore says",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/politics-news/francis-scott-key-bridge-ship-removal-wes-moore-baltimore-rcna152955"
  },
  {
    "title": "The lunch rush is dead as Americans live for the weekend",
    "publishedAt": "2024-05-19T14:00:00Z",
    "description": "More consumers are saving their workday lunch money to burn when they’re off the clock.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/consumer/lunch-rush-dead-americans-live-weekend-rcna151652"
  },
  {
    "title": "706 people named Kyle got together in Texas, but it wasn’t enough for a world record",
    "publishedAt": "2024-05-19T13:48:28Z",
    "description": "KYLE, Texas — How many people named Kyle can fit in one place?",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/706-people-named-kyle-got-together-texas-wasnt-enough-world-record-rcna152964"
  },
  {
    "title": "Helicopter carrying Iran’s president suffers a ‘hard landing,’ state TV says without further details",
    "publishedAt": "2024-05-19T13:19:00Z",
    "description": "A helicopter carrying Iranian President Ebrahim Raisi suffered a “hard landing” on Sunday, Iranian state television reported, without immediately elaborating.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/helicopter-carrying-irans-president-suffers-hard-landing-state-tv-says-rcna152961"
  },
  {
    "title": "Airbnb carbon monoxide detector mandate would be ‘very hard,’ CEO says, despite deaths",
    "publishedAt": "2024-05-19T11:48:35Z",
    "description": "Airbnb CEO Brian Chesky said the company is working to address customer complaints and safety issues but that there are limitations on what it can do to keep customers safe from issues like carbon monoxide poisoning.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/tech/tech-news/airbnb-carbon-monoxide-detector-mandate-hard-ceo-says-deaths-rcna152745"
  },
  {
    "title": "Israel's Netanyahu faces growing pressure over Gaza plan from his own war cabinet",
    "publishedAt": "2024-05-19T11:17:56Z",
    "description": "Pressure is mounting on Benjamin Netanyahu to change course in the seven-month war on Hamas, after a key member of his war cabinet threatened to quit on Saturday, adding to weeks of foreign criticism.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/israels-netanyahu-faces-growing-pressure-gaza-plan-war-cabinet-rcna152953"
  },
  {
    "title": "China promises 'friendship' as two warships dock in Cambodia",
    "publishedAt": "2024-05-19T10:15:51Z",
    "description": "Two Chinese warships docked Sunday at a commercial port in Cambodia, in preparation for joint naval exercises between the two countries.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/china-promises-friendship-two-warships-dock-cambodia-rcna152952"
  },
  {
    "title": "ADHD drug shortage shows signs of letting up, but some patients still struggle",
    "publishedAt": "2024-05-19T10:00:00Z",
    "description": "ADHD medication shortages have largely been resolved, says the FDA. However, some doctors and patients still report difficulties in obtaining prescriptions.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/health/health-news/adhd-drug-shortages-fda-easing-affecting-patients-rcna152570"
  },
  {
    "title": "Biden to deliver Morehouse graduation speech amid concerns from faculty and students",
    "publishedAt": "2024-05-19T09:00:00Z",
    "description": "President Joe Biden will deliver the Morehouse College commencement address Sunday, his most direct engagement with college students since the start of the Israel-Hamas war and a key opportunity for him to engage with a group of voters that data suggests is s…",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-morehouse-graduation-speech-concerns-faculty-students-rcna151991"
  },
  {
    "title": "WikiLeaks’ Julian Assange faces U.S. extradition judgment day",
    "publishedAt": "2024-05-19T08:26:33Z",
    "description": "LONDON — A British court could give a final decision on Monday on whether WikiLeaks’ founder Julian Assange should be extradited to the United States over the mass leak of secret U.S. documents, the culmination of 13 years of legal battles and detentions.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/wikileaks-julian-assange-faces-us-extradition-judgment-day-rcna152951"
  },
  {
    "title": "‘How do you get hypothermia in a prison?’ Records show hospitalizations among Virginia inmates",
    "publishedAt": "2024-05-19T08:05:46Z",
    "description": "A lawsuit has raised broader questions about conditions at the southwest Virginia prison, which the grand jury described as “inhumane and deplorable.”",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/-get-hypothermia-prison-records-show-hospitalizations-virginia-inmates-rcna152950"
  },
  {
    "title": "Disneyland character and parade performers in California vote to join labor union",
    "publishedAt": "2024-05-19T06:43:49Z",
    "description": "Disneyland performers who help bring beloved characters to life at the Southern California resort chose to unionize following a three-day vote.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/disneyland-character-parade-performers-california-vote-join-labor-unio-rcna152949"
  },
  {
    "title": "How 'Bridgerton' Season 3 puts a new spin on the 'makeover' trope",
    "publishedAt": "2024-05-19T02:28:47Z",
    "description": "Penelope Featherington — and actor Nicola Coughlan in turn — is stepping “out of the shadows” and into the center of the dance floor.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/bridgerton-season-3-puts-new-spin-makeover-trope-rcna152947"
  },
  {
    "title": "Missouri judge allows former 'honorary' member of KKK to remain on state's GOP primary ballot",
    "publishedAt": "2024-05-19T01:55:20Z",
    "description": "A Missouri judge ruled that a former \"honorary\" member of the Ku Klux Klan can remain on the state's Republican primary ballot for governor.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/2024-election/missouri-judge-allows-former-honorary-member-kkk-remain-states-gop-pri-rcna152933"
  },
  {
    "title": "Schauffele and Morikawa tied at the PGA Championship; Scheffler not a contender",
    "publishedAt": "2024-05-19T01:45:32Z",
    "description": "The cheers were endless Saturday in the PGA Championship, and when another record day of scoring finally ended at vulnerable Valhalla, so were the possibilities.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/sports/schauffele-morikawa-tied-pga-championship-scheffler-not-contender-rcna152944"
  },
  {
    "title": "John Stamos shares rare picture with Olsen twins and ‘Full House’ cast for Bob Saget’s birthday tribute",
    "publishedAt": "2024-05-19T01:16:42Z",
    "description": "John Stamos paid tribute to Bob Saget on what would’ve been his 68th birthday.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/celebrity/john-stamos-shares-rare-picture-olsen-twins-full-house-cast-bob-sagets-rcna152943"
  },
  {
    "title": "6 dead, 10 hurt as wrong-way pickup hits van packed with passengers in Idaho",
    "publishedAt": "2024-05-19T01:11:39Z",
    "description": "Six people died and 10 others were injured when a pickup truck veered into oncoming traffic and hit a passenger van filled with people in Idaho Falls, Idaho, on Saturday morning.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/dead-hurt-wrong-way-pickup-van-passengers-idaho-rcna152934"
  },
  {
    "title": "Simone Biles wins Core Hydration Classic to kick off road to Paris; Gabby Douglas withdraws",
    "publishedAt": "2024-05-19T01:03:59Z",
    "description": "2024 is looking golden so far for Simone Biles.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/sports/simone-biles-wins-core-hydration-classic-gabby-douglas-withdraws-rcna152859"
  },
  {
    "title": "Alice Stewart, CNN political commentator, dies at 58",
    "publishedAt": "2024-05-19T00:27:07Z",
    "description": "Alice Stewart, a CNN political commentator and veteran political adviser who worked on a number of GOP presidential campaigns, has died at age 58, the news network reported Saturday.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/alice-stewart-cnn-political-commentator-dies-58-rcna152941"
  },
  {
    "title": "Oleksandr Usyk beats Tyson Fury by split decision to become the undisputed heavyweight champion",
    "publishedAt": "2024-05-19T00:16:21Z",
    "description": "Oleksandr Usyk defeated Tyson Fury by split decision to become the first undisputed heavyweight boxing champion in 24 years.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/sports/oleksandr-usyk-beats-tyson-fury-split-decision-become-undisputed-heavy-rcna152940"
  },
  {
    "title": "Trump accepts NRA endorsement, urges gun owners to turn out to vote",
    "publishedAt": "2024-05-19T00:13:24Z",
    "description": "The National Rifle Association is supporting former President Donald Trump, an expected endorsement as the Republican nominee urged gun owners to vote in 2024.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-accepts-nra-endorsement-urges-gun-owners-vote-2024-rcna152938"
  },
  {
    "title": "Seize the Grey wins the Preakness Stakes, ruining Mystik Dan’s Triple Crown odds",
    "publishedAt": "2024-05-18T23:13:33Z",
    "description": "Dark horse Seize the Grey galloped to a Preakness Stakes victory in Baltimore on Saturday, denying Mystik Dan a place in history and delivering another garland of Black-Eyed Susans to legendary trainer D. Wayne Lukas.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/sports/preakness-winner-2024-horse-race-rcna151757"
  },
  {
    "title": "How to watch as Manchester City, Arsenal vie for Premier League title on Championship Sunday",
    "publishedAt": "2024-05-18T22:19:09Z",
    "description": "The English Premier League title will be on the line for two clubs, Manchester City and Arsenal, based on Sunday’s final matches of the season.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/sports/premier-league-title-arsenal-manchester-city-how-watch-rcna152502"
  },
  {
    "title": "Mystik Dan enters the Preakness Stakes as the favorite after winning Kentucky Derby",
    "publishedAt": "2024-05-18T21:28:21Z",
    "description": "Latest news and live updates as Preakness 2024 kicks off. Learn more about what horses are racing, when it is, what time it starts, what the stakes look like and more.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/sports/live-blog/preakness-2024-live-updates-rcna152498"
  },
  {
    "title": "Police arrest suspect in 1989 cold case killing of 78-year-old Pennsylvania woman",
    "publishedAt": "2024-05-18T20:32:05Z",
    "description": "More than 30 years after an elderly woman was stabbed to death inside her Lehigh Valley home, an arrest has been made in her murder.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/police-arrest-suspect-1989-cold-case-killing-78-year-old-pennsylvania-rcna152929"
  },
  {
    "title": "Sex offender arrested after faking death to avoid registering, Arizona sheriff says",
    "publishedAt": "2024-05-18T19:23:46Z",
    "description": "A convicted sex offender tried to fake his own death to avoid registering, an Arizona sheriff said this week.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/sex-offender-arrested-faking-death-avoid-registering-arizona-sheriff-s-rcna152919"
  },
  {
    "title": "Israel recovers another slain hostage; pushes into new parts of northern Gaza",
    "publishedAt": "2024-05-18T18:36:06Z",
    "description": "CAIRO/JERUSALEM — Israeli troops and tanks pushed on Saturday into parts of a congested northern Gaza Strip district that they had previously skirted in the more than seven-month-old war, killing and wounding dozens of Palestinians, medics and residents said.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/israel-recovers-another-slain-hostage-pushes-new-parts-northern-gaza-rcna152920"
  },
  {
    "title": "L.A. County investigating reported hepatitis A case at Beverly Hills Whole Foods",
    "publishedAt": "2024-05-18T18:33:53Z",
    "description": "Los Angeles County public health officials are investigating a reported case of hepatitis A in an employee at a Whole Foods supermarket in Beverly Hills.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/l-county-investigating-reported-hepatitis-case-beverly-hills-whole-foo-rcna152914"
  },
  {
    "title": "Netanyahu rival Benny Gantz says he’ll quit Israel’s War Cabinet on June 8 unless new Gaza plan devised",
    "publishedAt": "2024-05-18T18:29:20Z",
    "description": "DEIR AL-BALAH, Gaza Strip — Benny Gantz, a member of Israel’s three-man War Cabinet, has threatened to resign from the government if it doesn’t adopt a new plan for the war in Gaza, a move that would leave Prime Minister Benjamin Netanyahu more reliant on his…",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/netanyahu-rival-benny-gantz-says-ll-quit-israels-war-cabinet-june-8-un-rcna152916"
  },
  {
    "title": "Imprisoned Oregon man charged in deaths of three women found in Portland area last year",
    "publishedAt": "2024-05-18T18:24:36Z",
    "description": "An imprisoned Oregon man was indicted Friday in connection with the deaths of three women whose bodies were found “under suspicious circumstances” last year in the Portland area, authorities announced Friday.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/imprisoned-oregon-man-charged-deaths-three-women-found-portland-area-l-rcna152889"
  },
  {
    "title": "Some consumers are punting big purchases like pools and mattresses",
    "publishedAt": "2024-05-18T18:17:28Z",
    "description": "Americans are kicking the can down the road on some more-costly, traditionally financed purchases as elevated inflation and interest rates bite.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/business-news/consumers-are-punting-big-purchases-pools-mattresses-rcna152909"
  },
  {
    "title": "Arizona police rescue 6-month-old who had been shot during hostage standoff",
    "publishedAt": "2024-05-18T17:11:41Z",
    "description": "Arizona police officers burst into a house to rescue a 6-month-old who had been shot multiple times after the child's father took the infant and its mother hostage.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/arizona-police-rescue-6-month-old-shot-hostage-standoff-rcna152907"
  },
  {
    "title": "Houston distributes water as more than 500,000 remain without power after devastating storms",
    "publishedAt": "2024-05-18T17:02:11Z",
    "description": "The city of Houston on Saturday opened new distribution centers to give out water as around 500,000 customers remained without power following severe storms blamed in the deaths of seven people in the region.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/weather/houston-distributes-water-500000-remain-power-devastating-storms-rcna152908"
  },
  {
    "title": "Two hours after mocking Arizona’s Attorney General, Rudy Giuliani is served at his own birthday party",
    "publishedAt": "2024-05-18T16:37:27Z",
    "description": "PHOENIX — Arizona’s Democratic Attorney General Kris Mayes on Friday announced that Rudy Giuliani had been served with the notice of his indictment on charges related to a conspiracy to overturn the 2020 election results in Arizona.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/politics-news/two-hours-mocking-arizonas-attorney-general-rudy-giuliani-served-birth-rcna152905"
  },
  {
    "title": "Country star Zac Brown sues estranged wife Kelly Yazdi over Instagram post",
    "publishedAt": "2024-05-18T15:27:35Z",
    "description": "Zac Brown filed a lawsuit against his estranged wife Friday demanding she take down an Instagram post, arguing what she put online has tarnished his public image.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/celebrity/country-star-zac-brown-sues-estranged-wife-kelly-yazdi-instagram-post-rcna152901"
  },
  {
    "title": "Flash floods due to unusually heavy seasonal rains kill at least 68 people in Afghanistan",
    "publishedAt": "2024-05-18T14:46:45Z",
    "description": "ISLAMABAD — Flash floods from heavy seasonal rains have killed at least 68 people in Afghanistan, Taliban officials said Saturday, adding the death toll was based on preliminary reports.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/flash-floods-due-unusually-heavy-seasonal-rains-kill-least-68-people-a-rcna152900"
  },
  {
    "title": "Man who sought revenge for a stolen phone pleads guilty to fire that killed a Senegalese family of 5",
    "publishedAt": "2024-05-18T13:27:02Z",
    "description": "DENVER — A Colorado man pleaded guilty to murder charges on Friday for starting a 2020 house fire that killed five members of a Senegalese family out of misplaced revenge for a stolen iPhone that he mistakenly tracked to the house.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/crime-courts/man-sought-revenge-stolen-phone-pleads-guilty-fire-killed-senegalese-f-rcna152897"
  },
  {
    "title": "Phoenix is beating the rest of the country on inflation — on paper anyway",
    "publishedAt": "2024-05-18T13:00:00Z",
    "description": "Phoenix is closer to winning the war on inflation than most other cities.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/economy/phoenix-beating-rest-us-inflation-largely-due-rents-rcna151110"
  },
  {
    "title": "College students who protested and those who didn't share in disappointment at response from schools",
    "publishedAt": "2024-05-18T11:00:00Z",
    "description": "After a semester marked by sweeping protests on college campuses across the nation that raised questions about freedom of speech, how universities confront allegations of antisemitism and Islamophobia and how they invest, some students who experienced the dem…",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/college-students-protested-didnt-share-disappointment-response-schools-rcna152638"
  },
  {
    "title": "Study links talc use to ovarian cancer — a potential boon for thousands suing J\u0026J",
    "publishedAt": "2024-05-18T11:00:00Z",
    "description": "Ongoing lawsuits against J\u0026J allege that its talc-based baby powder caused ovarian cancer. A new study lends credence to the claims.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/health/cancer/talc-baby-powder-linked-ovarian-cancer-jj-lawsuit-rcna152493"
  },
  {
    "title": "Alabama Republicans pledged to revisit IVF in hopes of a long-term fix. They never did.",
    "publishedAt": "2024-05-18T11:00:00Z",
    "description": "When Republicans in Alabama enacted a law earlier this year to protect in vitro fertilization following a court decision that halted the treatment in the deeply conservative state, they pitched it as a temporary fix.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/alabama-republicans-ivf-long-term-fix-rcna152834"
  },
  {
    "title": "Slovak PM still in serious condition after shooting as suspect appears in court",
    "publishedAt": "2024-05-18T10:54:42Z",
    "description": "Slovak Prime Minister Robert Fico’s condition was stable but serious Saturday as the man accused of trying to assassinate him faced his first court appearance.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/slovak-pm-fico-serious-condition-shooting-suspect-appears-court-rcna152892"
  },
  {
    "title": "Four minors found working at Alabama poultry plant run by same firm found responsible for Mississippi teen's death",
    "publishedAt": "2024-05-18T10:30:00Z",
    "description": "Four minors were allegedly found working at an Alabama slaughterhouse run by the same firm found responsible for the death of a Mississippi 16-year-old in 2023.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/business-news/four-minors-found-working-mar-jac-alabama-poultry-plant-rcna152448"
  },
  {
    "title": "Kamala Harris to speak at SEIU convention set to elect the union's first Black president",
    "publishedAt": "2024-05-18T10:00:00Z",
    "description": "April Verrett is poised to become the first Black president of the Service Employees International Union, which represents nearly 2 million workers.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-seiu-union-first-black-president-rcna152823"
  },
  {
    "title": "Ex-military surgeons embrace new mission: stop Americans from bleeding to death",
    "publishedAt": "2024-05-18T10:00:00Z",
    "description": "A movement to revolutionize the treatment of trauma patients in the U.S. can be traced to an infamous battle fought in East Africa more than 30 years ago.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/investigations/ex-military-surgeons-embrace-new-mission-stop-americans-bleeding-death-rcna151034"
  },
  {
    "title": "Trump's hush money trial makes big money for professional line-standers",
    "publishedAt": "2024-05-18T10:00:00Z",
    "description": "The hottest ticket in New York City is Trump's hush money trial and some are willing to pay big to get to see testimony from Stormy Daniels, Michael Cohen, and more.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/donald-trump/donald-trumps-hush-money-trial-big-money-line-standers-rcna152809"
  },
  {
    "title": "Ukraine fears new Russian offensive is only ‘the first wave’ of a brutal summer",
    "publishedAt": "2024-05-18T09:28:14Z",
    "description": "President Volodymr Zelenskyy has warned that Russia's new offensive in the northeastern Kharkiv region could be just the first wave while U.S. aid delays hurt Kyiv.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/ukraine-russia-kharkiv-offensive-first-wave-zelenskyy-west-rcna152890"
  },
  {
    "title": "Amid signs of waning enthusiasm, Biden reaches out to Black voters",
    "publishedAt": "2024-05-18T09:00:00Z",
    "description": "This weekend, President Joe Biden will hold events in cities like Detroit, where Black turnout is critical to efforts in two of the closest battleground states.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/2024-election/joe-biden-reaches-black-voters-waning-enthusiasm-rcna152741"
  },
  {
    "title": "Gunmen kill three Spanish tourists in Afghanistan’s central Bamyan province",
    "publishedAt": "2024-05-18T08:34:31Z",
    "description": "Three Spanish tourists were killed and at least one Spaniard was injured in an attack by gunmen in Afghanistan’s central Bamyan province, Spain’s foreign ministry said on Friday.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/gunmen-kill-three-spanish-tourists-afghanistans-central-bamyan-provinc-rcna152891"
  },
  {
    "title": "John Oates talks ‘Reunion’ and the likelihood of one with Daryl Hall",
    "publishedAt": "2024-05-18T03:59:18Z",
    "description": "It was 1974 when John Oates and Daryl Hall first landed on the Billboard Hot 100 with their hit single “She’s Gone.”",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/john-oates-talks-reunion-likelihood-one-daryl-hall-rcna152888"
  },
  {
    "title": "Trump falsely claims he won Minnesota in 2020",
    "publishedAt": "2024-05-18T03:18:15Z",
    "description": "Former President Donald Trump reiterated a false claim on Friday that he won Minnesota in 2020, despite Democratic candidates carrying it for over 40 years.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/2020-election/donald-trump-falsely-claims-won-minnesota-2020-presidential-election-rcna152884"
  },
  {
    "title": "113-year-old tower in Death Valley National Park felled by traveler trying to get vehicle out of mud",
    "publishedAt": "2024-05-18T02:41:47Z",
    "description": "A historic wooden tower was inadvertently felled by a traveler who used it to winch a vehicle stuck in mud in California's Death Valley National Park, federal officials said.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/113-year-old-tower-death-valley-national-park-felled-traveler-trying-g-rcna152876"
  },
  {
    "title": "7 dead in Houston area after storms, 100 mph winds",
    "publishedAt": "2024-05-18T01:04:45Z",
    "description": "Seven people have died in Houston, Texas, and the surrounding county after severe weather that ripped down power lines and trees and toppled brick walls, officials said Friday.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/7-dead-texas-harris-county-storms-100-mph-winds-rcna152874"
  },
  {
    "title": "New talk of creating a Hunter Biden legal defense fund as main benefactor retreats",
    "publishedAt": "2024-05-18T00:49:20Z",
    "description": "The financing crunch comes at a precarious time for President Joe Biden's son, whose two criminal trials are set to begin in June.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/politics-news/hunter-biden-legal-defense-fund-discussion-main-benefactor-retreats-rcna152849"
  },
  {
    "title": "Newly released photos depict cash and gold bars seized from Sen. Bob Menendez's home",
    "publishedAt": "2024-05-18T00:47:05Z",
    "description": "The pictures were entered as evidence by prosecutors, who accuse the high-profile New Jersey Democrat of accepting “hundreds of thousands of dollars” in bribes.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/congress/new-photos-depict-cash-gold-bars-seized-new-jersey-sen-bob-menendezs-h-rcna152856"
  },
  {
    "title": "17 of 20 U.S. doctors stuck in Gaza depart with the help of U.S. officials, source says",
    "publishedAt": "2024-05-18T00:32:04Z",
    "description": "Seventeen of 20 U.S. doctors stuck in Gaza have departed, with the physician known for saving Sen.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/17-20-us-doctors-stuck-gaza-depart-help-us-officials-source-says-rcna152866"
  },
  {
    "title": "Man accused of sucker-punching Steve Buscemi on NYC street is arrested",
    "publishedAt": "2024-05-17T23:59:44Z",
    "description": "A man has been arrested on suspicion of sucker-punching actor Steve Buscemi in the face earlier this month in Manhattan, police said.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/man-accused-sucker-punching-steve-buscemi-nyc-street-arrested-rcna152871"
  },
  {
    "title": "Dabney Coleman, '9 to 5' actor who specialized in curmudgeons, dies at 92",
    "publishedAt": "2024-05-17T23:27:08Z",
    "description": "Dabney Coleman, the mustachioed character actor who specialized in smarmy villains like the chauvinist boss in “9 to 5” and the nasty TV director in “Tootsie,” has died.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/tv/dabney-coleman-9-5-actor-specialized-curmudgeons-dies-92-rcna152870"
  },
  {
    "title": "11 chef-approved rice cookers",
    "publishedAt": "2024-05-17T22:26:51Z",
    "description": "Rice cookers can cook rice more evenly and make it fluffy delicious. Chefs recommend their favorite rice cookers from brands like Panosonic and Zojirushi.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/select/shopping/best-rice-cookers-ncna1298410"
  },
  {
    "title": "RFK Jr. revs up ballot access campaign in response to sped-up debate criteria",
    "publishedAt": "2024-05-17T22:23:04Z",
    "description": "Robert F. Kennedy Jr. is accelerating plans to get on state ballots after Joe Biden, Donald Trump and CNN agreed on a June debate.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-revs-ballot-access-campaign-response-sped-debate-criteria-rcna152708"
  },
  {
    "title": "Death of teen who ate a spicy chip has experts rethinking capsaicin and its effects",
    "publishedAt": "2024-05-17T22:03:30Z",
    "description": "The tragic death of a Massachusetts teenager who collapsed after eating an extremely spicy tortilla chip last year may prompt both doctors and food manufacturers to take a closer look at the ingredient that provides the punch — capsaicin.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/death-teen-ate-spicy-chip-experts-rethinking-capsaicin-effects-rcna152766"
  },
  {
    "title": "Can Trump put Minnesota in play?: From the Politics Desk",
    "publishedAt": "2024-05-17T21:56:36Z",
    "description": "Donald Trump hopes Minnesota becomes a battleground state in the 2024 election against Joe Biden, who is ramping up his Black voter outreach.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/trump-biden-minnesota-battleground-politics-desk-rcna152825"
  },
  {
    "title": "Chevy Bolt owners to receive settlement checks after successful class-action suit over faulty batteries",
    "publishedAt": "2024-05-17T21:38:02Z",
    "description": "Chevy Bolt owners are eligible for settlement checks as part of a $150 million class-action settlement with General Motors and South Korean industrial group LG over faulty batteries.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/consumer/chevy-bolt-settlement-checks-class-action-lawsuit-faulty-batteries-rcna152842"
  },
  {
    "title": "'No more games': Biden rejects additional debates against Trump",
    "publishedAt": "2024-05-17T21:33:41Z",
    "description": "President Joe Biden's campaign rejected two additional debates on Friday that former President Donald Trump's campaign says it agreed to do.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-rejects-debates-trump-nbc-telemundo-fox-news-rcna152860"
  },
  {
    "title": "California district to pay $360K to teacher fired for not following transgender policies",
    "publishedAt": "2024-05-17T21:28:37Z",
    "description": "A California school district settled a 2023 lawsuit from a former teacher who refused to adhere to the district’s gender identity-related policies.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/nbc-out/out-news/california-district-pay-360k-teacher-fired-not-transgender-policies-rcna152772"
  },
  {
    "title": "Rei Anniversary sale: The best deals to shop",
    "publishedAt": "2024-05-17T21:27:32Z",
    "description": "Rei is having an anniversary sale from now until May 27th. Get up to 30% off on outdoor gear, fitness essentials and apparel from the retailer.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/select/shopping/rei-anniversary-sale-2024-rcna152845"
  },
  {
    "title": "Frontier Airlines does away with change fees in budget airline pricing overhaul",
    "publishedAt": "2024-05-17T21:14:55Z",
    "description": "Frontier Airlines said it will stop charging customers a fee to change their flights, taking a page from larger competitors as the Biden administration issues stricter rules targeting so-called “junk fees.”",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/travel/frontier-airlines-away-change-fees-budget-airline-pricing-overhaul-rcna152861"
  },
  {
    "title": "'Not the time and place': Students speak out on Harrison Butker's 'uncomfortable' commencement address",
    "publishedAt": "2024-05-17T21:08:19Z",
    "description": "Harrison Butker’s commencement speech left some at Benedictine College outraged after the Kansas City Chiefs kicker encouraged women to become homemakers.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/students-speak-harrison-butkers-uncomfortable-commencement-speech-rcna152789"
  },
  {
    "title": "Dow closes at record high above 40,000 to cinch a five-week winning streak",
    "publishedAt": "2024-05-17T21:00:35Z",
    "description": "The Dow Jones Industrial Average closed Friday above the key 40,000 level for the first time in history, a day after hitting that benchmark in the previous trading session.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/markets/dow-closes-record-high-40000-cinch-five-week-winning-streak-rcna152858"
  },
  {
    "title": "Federal inmate accused of stabbing Derek Chauvin can represent himself at trial",
    "publishedAt": "2024-05-17T20:59:57Z",
    "description": "The federal inmate charged in December with stabbing former Minneapolis police officer Derek Chauvin in an Arizona prison can represent himself in court after a judge agreed to a request to waive his right to legal representation, court documents show.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/federal-inmate-accused-stabbing-derek-chauvin-can-represent-trial-rcna152851"
  },
  {
    "title": "Here's what has driven the Dow rally to 40,000, and why it could keep going",
    "publishedAt": "2024-05-17T20:52:03Z",
    "description": "Passing major milestones such as the 40,000 barrier the Dow Jones Industrial Average eclipsed this week makes for a nice headline, but market experts do not take much else from the move.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/markets/driven-dow-rally-40000-keep-going-rcna152853"
  },
  {
    "title": "The mother of a protester whose killer was pardoned says she was robbed of justice",
    "publishedAt": "2024-05-17T20:31:51Z",
    "description": "The mother of a man killed during a Black Lives Matter protest said Friday she was robbed of \"long overdue peace\" when Texas Gov.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/mother-protester-whose-killer-was-pardoned-says-was-robbed-justice-rcna152807"
  },
  {
    "title": "UAW loses Alabama union vote seen as bellwether for organizing auto workers in the South",
    "publishedAt": "2024-05-17T20:06:21Z",
    "description": "Workers at two Mercedes-Benz factories in Alabama have voted against joining the United Auto Workers, the largest auto workers union in the U.S., a blow to an effort to strengthen the presence of organized labor in the South.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/business-news/uaw-alabama-mercedes-union-vote-factories-results-rcna152629"
  },
  {
    "title": "Video appears to show Sean 'Diddy' Combs beating ex Cassie in 2016 hotel footage",
    "publishedAt": "2024-05-17T19:52:46Z",
    "description": "Surveillance video shows Sean “Diddy” Combs assaulting ex-girlfriend Cassie in a 2016 hotel attack. Cassie detailed the abuse in a since-settled lawsuit",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/diddy-assaults-ex-girlfriend-cassie-2016-hotel-incident-surveillance-v-rcna152822"
  },
  {
    "title": "Authorities are investigating a suspected arson attack that left three lesbians dead in Argentina",
    "publishedAt": "2024-05-17T19:51:40Z",
    "description": "An investigation is ongoing into a suspected arson attack at a Buenos Aires hotel that left three lesbian women dead and another injured last week.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/nbc-out/out-news/suspected-arson-attack-argentina-left-three-lesbians-dead-investigatio-rcna152799"
  },
  {
    "title": "Elle King shares what Dolly Parton told her after controversial tribute performance",
    "publishedAt": "2024-05-17T19:49:19Z",
    "description": "Elle King says she’s “mortified” about how she behaved onstage during a Dolly Parton tribute performance in January.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/elle-king-shares-dolly-parton-told-controversial-tribute-performance-rcna152841"
  },
  {
    "title": "Harris says more Indian American representation is needed in government",
    "publishedAt": "2024-05-17T19:48:19Z",
    "description": "Addressing a crowd of Indian Americans this week, Vice President Kamala Harris asserted the importance of voting and running. But Biden and Harris approval among the group has fallen.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/asian-america/kamala-harris-more-indian-american-representation-needed-government-rcna152761"
  },
  {
    "title": "'Back to Black' director opens up about 'noise' around Amy Winehouse biopic",
    "publishedAt": "2024-05-17T19:31:58Z",
    "description": "“Back to Black” director Sam Taylor-Johnson is opening up about any criticism she faced while making the movie.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/back-black-director-opens-noise-amy-winehouse-biopic-rcna152840"
  },
  {
    "title": "Haitian Flag Day 2024: A guide to events and ways to celebrate Haitian pride",
    "publishedAt": "2024-05-17T18:51:26Z",
    "description": "Food, soccer and Kompa: A guide to the best events and things to do for Haitian Flag Day on Saturday.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/nbcblk/haitian-flag-day-2024-best-events-things-to-do-guide-rcna150939"
  },
  {
    "title": "OpenAI dissolves team focused on long-term AI risks less than one year after announcing it",
    "publishedAt": "2024-05-17T18:32:24Z",
    "description": "OpenAI has disbanded its team focused on the long-term risks of artificial intelligence just one year after the company announced the group, a person familiar with the situation confirmed to CNBC on Friday.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/tech/tech-news/openai-dissolves-team-focused-long-term-ai-risks-less-one-year-announc-rcna152824"
  },
  {
    "title": "David DePape, man who attacked Paul Pelosi with a hammer, sentenced to 30 years in prison",
    "publishedAt": "2024-05-17T18:12:57Z",
    "description": "The hammer-wielding man who brutally attacked Paul Pelosi, husband of former House Speaker Nancy Pelosi, in their San Francisco home was sentenced to 30 years in prison on Friday.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/david-depape-man-attacked-paul-pelosi-hammer-sentenced-30-years-prison-rcna152614"
  },
  {
    "title": "Sen. Dick Durbin says Justice Alito should recuse in Trump cases because of upside-down flag",
    "publishedAt": "2024-05-17T18:01:23Z",
    "description": "WASHINGTON — Senate Majority Whip Dick Durbin, D-Ill., said Friday that Supreme Court Justice Samuel Alito should recuse himself from cases related to the 2020 election after a new report said an upside-down American flag flew outside his home in the days aft…",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/supreme-court/sen-dick-durbin-says-justice-alito-recuse-trump-cases-upside-flag-rcna152739"
  },
  {
    "title": "North Carolina will revoke license of wilderness camp where boy died",
    "publishedAt": "2024-05-17T17:42:41Z",
    "description": "Trails Carolina, a wilderness camp for troubled adolescents where a 12-year-old boy died in February, is losing its license.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/trails-carolina-wilderness-camp-boy-died-license-revoked-rcna146296"
  },
  {
    "title": "Chris Pratt pays tribute to Tony McFarr, his stunt double who died suddenly at 47",
    "publishedAt": "2024-05-17T17:37:20Z",
    "description": "Chris Pratt paid tribute to his late stunt double Tony McFarr in a heartfelt message on social media in which Pratt remembered their time on several movie sets together.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/chris-pratt-pays-tribute-tony-mcfarr-stunt-double-died-suddenly-47-rcna152811"
  },
  {
    "title": "Viral kids creator Ms. Rachel says she experienced bullying after fundraising for children in Gaza",
    "publishedAt": "2024-05-17T17:35:29Z",
    "description": "Viral kids creator Rachel Griffin Accurso, known as Ms. Rachel, said she’s experienced bullying online following a fundraiser she launched for children in Gaza.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/ms-rachel-bullying-fundraising-children-gaza-rcna152701"
  },
  {
    "title": "See Kevin Costner in new trailer for his Western epic, 'Horizon'",
    "publishedAt": "2024-05-17T17:18:07Z",
    "description": "A new Kevin Costner movie is on the horizon.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/see-kevin-costner-new-trailer-western-epic-horizon-rcna152801"
  },
  {
    "title": "Glen Powell says he and Sydney Sweeney are planning to work together again",
    "publishedAt": "2024-05-17T17:13:12Z",
    "description": "Glen Powell and Sydney Sweeney are already planning on starring in another movie again.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/glen-powell-says-sydney-sweeney-are-planning-work-together-rcna152800"
  },
  {
    "title": "Former Trump attorney John Eastman pleads not guilty in Arizona election interference case",
    "publishedAt": "2024-05-17T17:04:11Z",
    "description": "John Eastman, a former attorney for former president Donald Trump, pleaded not guilty on Friday to charges related to a conspiracy to overturn the 2020 election results in Arizona.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/politics-news/former-trump-attorney-john-eastman-pleads-not-guilty-arizona-election-rcna152793"
  },
  {
    "title": "2024 Preakness Stakes guide: Date, location, time, TV channels, betting favorites and more",
    "publishedAt": "2024-05-17T17:00:00Z",
    "description": "Mystik Dan shocked the horse racing world by winning the 150th running of the Kentucky Derby this month, and now he will have a chance to take one step closer to the Triple Crown with the Preakness Stakes at Pimlico Race Course in Baltimore.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/sports/2024-preakness-stakes-guide-date-location-time-tv-channels-betting-fav-rcna152503"
  },
  {
    "title": "Pa. man accused of killing roommate, dismembering body and scattering remains",
    "publishedAt": "2024-05-17T16:50:44Z",
    "description": "A Lehigh County man is accused of killing his roommate with a hammer, dismembering his body and then scattering his remains in three separate locations.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/us-news/pa-man-accused-killing-roommate-dismembering-body-scattering-remains-rcna152782"
  },
  {
    "title": "Deal written on a napkin that sent Lionel Messi to Barcelona sells at auction for $965,000",
    "publishedAt": "2024-05-17T16:09:23Z",
    "description": "The famous napkin that linked a young Lionel Messi to Barcelona sold for 762,400 pounds ($965,000) on Friday, British auction house Bonhams said.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/sports/deal-written-napkin-sent-lionel-messi-barcelona-sells-auction-965000-rcna152777"
  },
  {
    "title": "As Tesla layoffs continue, here are 600 jobs the company cut in California",
    "publishedAt": "2024-05-17T15:52:09Z",
    "description": "As part of Tesla’s massive restructuring, the electric-vehicle maker notified the California Employment Development Department this week that it’s cutting approximately 600 more employees at its manufacturing facilities and engineering offices between Fremont…",
    "Publisher": "",
    "url": "https://www.nbcnews.com/business/business-news/tesla-layoffs-continue-are-600-jobs-company-cut-california-rcna152780"
  },
  {
    "title": "Taiwan lawmakers exchange blows in bitter dispute over parliament reforms",
    "publishedAt": "2024-05-17T15:42:56Z",
    "description": "Lawmakers in Taiwan shoved, tackled and hit each other in a bitter dispute about parliamentary reforms, days before President-elect Lai Ching-te takes office/",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/taiwan-lawmakers-exchange-blows-bitter-dispute-parliament-reforms-rcna152763"
  },
  {
    "title": "Israel says it recovers 3 bodies of festivalgoers slain by Hamas on Oct. 7",
    "publishedAt": "2024-05-17T15:38:12Z",
    "description": "Israeli officials on Friday announced their forces in Gaza had recovered the bodies of three revelers killed by Hamas attackers near the Supernova, or Nova, music festival on Oct. 7.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/israel-says-recovers-3-bodies-festivalgoers-slain-hamas-rcna152775"
  },
  {
    "title": "He feared coming out. Now this pastor wants to help Black churches become as welcoming as his own",
    "publishedAt": "2024-05-17T15:29:33Z",
    "description": "Rev. Brandon Thomas Crowley hopes his new book, \"Queering the Black Church,\" can serve as a guide for other congregations to be “open and affirming” to LGBTQ people.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/nbc-out/out-community-voices/feared-coming-now-pastor-wants-help-black-churches-become-welcoming-rcna152758"
  },
  {
    "title": "The best early Memorial Day 2024 sales",
    "publishedAt": "2024-05-17T15:19:46Z",
    "description": "Shop the best early Memorial Day deals across categories like mattresses, furniture, tech and more from brands like Casper, Burrow, Apple and Roku.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/select/shopping/best-early-memorial-day-sales-2024-rcna152762"
  },
  {
    "title": "Statue weeping blood? Visions of the Virgin Mary? Vatican has new advice on supernatural phenomena",
    "publishedAt": "2024-05-17T14:58:52Z",
    "description": "The Vatican has issued new rules radically reforming its process for evaluating faith-based supernatural phenomena like visions of the Virgin Mary or stigmata.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/pope-francis-catholic-church-supernatural-phenomena-virgin-mary-rcna152721"
  },
  {
    "title": "Abortion rights amendment qualifies for the South Dakota ballot",
    "publishedAt": "2024-05-17T14:43:38Z",
    "description": "South Dakota officials certified a proposed amendment that would enshrine abortion access in the state’s constitution to appear on the November ballot.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/politics/2024-election/abortion-rights-ballot-measure-south-dakota-rcna152746"
  },
  {
    "title": "Putin concludes China trip by emphasizing ties with Russia",
    "publishedAt": "2024-05-17T14:42:24Z",
    "description": "Russian President Vladimir Putin concluded a visit to China, emphasizing the countries’ strategic ties as well as his relationship with  Xi Jinping.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/news/world/russia-china-vladimir-putin-xi-jingpin-ukraine-rcna152749"
  },
  {
    "title": "Atlanta officer accused of killing Lyft driver allegedly said victim was ‘gay fraternity’ recruiter",
    "publishedAt": "2024-05-17T14:29:43Z",
    "description": "An Atlanta police officer accused of murdering a Lyft driver allegedly said the victim was in a gay fraternity trying to recruit him.",
    "Publisher": "",
    "url": "https://www.nbcnews.com/nbc-out/out-news/atlanta-officer-accused-killing-lyft-driver-allegedly-said-victim-was-rcna152751"
  },
  {
    "title": "South Korea fires warning shots after North Korean soldiers make 3rd incursion, Seoul says\n",
    "publishedAt": "Thu, 20 Jun 2024 22:39:49 -0400",
    "description": "South Korea's military said Friday that it had fired warnings shots the previous day to repel North Korean soldiers who temporarily crossed the rivals' land border for the third time this month.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/south-korea-fires-warning-shots-after-north-korean/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Chinese farmland purchases near U.S. military bases raise national security concerns\n",
    "publishedAt": "Thu, 20 Jun 2024 17:51:47 -0400",
    "description": "China's acquisition of farmland near critical U.S. military bases has sparked significant national security concerns, with fears of potential espionage or sabotage growing.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/chinese-farmland-purchases-near-us-military-bases-/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "New Cuban Missile Crisis? Potential Russian nukes in space threaten U.S., House Intel chair warns\n",
    "publishedAt": "Thu, 20 Jun 2024 17:18:49 -0400",
    "description": "The U.S. is facing a new Cuban Missile Crisis. But instead of Russian nuclear warheads parked just 90 miles from Florida, the Kremlin now wants to put them in low-earth orbit, where they could threaten critical American satellites.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/new-cuban-missile-crisis-potential-russian-nukes-s/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Chinese triads linked to Mexico's Sinaloa cartel\n",
    "publishedAt": "Thu, 20 Jun 2024 16:45:04 -0400",
    "description": "The Justice Department on Wednesday released a federal indictment outlining the ties between Chinese organized crime groups and Mexico's Sinaloa drug cartel.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/chinese-triads-linked-mexicos-sinaloa-cartel/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Xi echoes Mao in urging communist political control over PLA 'guns'\n",
    "publishedAt": "Thu, 20 Jun 2024 13:59:00 -0400",
    "description": "China's supreme leader this week urged the People's Liberation Army to maintain Chinese Communist Party political control over the \"guns\" of the nation, an echo of the country's late ruler, Mao Zedong.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/xi-echoes-mao-urging-communist-political-control-o/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Senators want to designate Russia as a state sponsor of terror after Putin's pact with North Korea\n",
    "publishedAt": "Thu, 20 Jun 2024 13:53:10 -0400",
    "description": "Two senators announced legislation Thursday that would designate Russia as a state sponsor of terror, a move that would put Moscow in a small and notorious group that includes North Korea and Iran, in the wake of Russia's mutual defense pact with Pyongyang.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/senators-want-to-designate-russia-as-state-sponsor/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "'Vexing' and 'perplexing': White House chastises Netanyahu over video\n",
    "publishedAt": "Thu, 20 Jun 2024 13:12:04 -0400",
    "description": "The White House criticized Israeli Prime Minister Benjamin Netanyahu on Thursday for blindsiding it with a video that accuses the U.S. of withholding weapons from his country.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/vexing-and-perplexing-white-house-chastises-netany/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Kim-Putin agreement: Real military alliance or paper partnership?\n",
    "publishedAt": "Thu, 20 Jun 2024 12:52:35 -0400",
    "description": "The flag-waving optics of this week's historic meeting between Russian President Vladimir Putin and North Korean leader Kim Jong-un have given way to a key question: Is the \"comprehensive strategic partnership\" signed by the two men the start of a true bilateral military partnership?\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/kim-putin-agreement-real-military-alliance-or-pape/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "U.S. redirects interceptor missile deliveries to Ukraine\n",
    "publishedAt": "Thu, 20 Jun 2024 12:01:34 -0400",
    "description": "The U.S. has made the \"difficult but necessary\" decision to prioritize the delivery of certain air-defense missiles to Ukraine, meaning other countries expecting shipments must wait, the White House said Thursday.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/us-redirects-interceptor-missile-deliveries-to-ukr/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Shipping industry calls for greater action to stop Houthis' Red Sea attacks\n",
    "publishedAt": "Thu, 20 Jun 2024 11:10:00 -0400",
    "description": "The global shipping industry sounded the alarm this week about the safety of merchant vessels operating in the Red Sea after a second ship was sunk by Yemen's Iranian-backed Houthi rebels earlier this week.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/shipping-industry-calls-greater-action-stop-houthi/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Rifts seem to appear between Israel's political and military leadership over conduct of the Gaza war\n",
    "publishedAt": "Thu, 20 Jun 2024 10:39:17 -0400",
    "description": "The Israeli army's chief spokesman on Wednesday appeared to question the stated goal of destroying the Hamas militant group in Gaza in a rare public rift between the country's political and military leadership.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/public-rifts-appear-between-israels-political-and-/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Thousands protest in Jerusalem to call for immediate elections and release of hostages in Gaza\n",
    "publishedAt": "Thu, 20 Jun 2024 10:20:02 -0400",
    "description": "Thousands of people held a protest in Jerusalem for a second day on Tuesday, calling for fresh elections and an end to the war in Gaza.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/thousands-protest-jerusalem-call-immediate-electio/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "U.S.-built pier in Gaza up and running again after setbacks\n",
    "publishedAt": "Thu, 20 Jun 2024 09:33:18 -0400",
    "description": "The U.S. military-built pier in Gaza is up and running again after being detached for a second time last week because of rough seas, according to Cyprus officials Thursday.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/us-built-pier-in-gaza-up-and-running-again-after-s/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "French prime minister seeks to step out from Macron's shadow in the upcoming early election\n",
    "publishedAt": "Thu, 20 Jun 2024 09:31:30 -0400",
    "description": "Thrust into an early election sprung by his boss, France's prime minister hopes to emerge from the campaign not only still holding the job that President Emmanuel Macron gave him less than six months ago but also as more of his own person.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/french-prime-minister-looks-to-step-out-from-macro/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Train collision in Chile kills at least 2 people and injures 9 others\n",
    "publishedAt": "Thu, 20 Jun 2024 09:31:21 -0400",
    "description": "At least two people were killed and nine others injured Thursday when a train full of passengers collided head-on with another train on a test run just outside the capital of Chile, where fatal railway crashes remain rare.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/train-collision-in-chile-kills-at-least-two-people/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Serbia FA threatens to quit Euros if UEFA does not punish Croats and Albanians over chants\n",
    "publishedAt": "Thu, 20 Jun 2024 09:26:15 -0400",
    "description": "Serbia soccer officials threatened to quit the European Championship after they were offended by fan chants reportedly heard during the Albania-Croatia match.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/serbia-threatens-to-quit-euros-if-uefa-does-not-pu/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "And then there was one: Mark Rutte. Romania's president withdraws from the race for NATO chief\n",
    "publishedAt": "Thu, 20 Jun 2024 09:25:12 -0400",
    "description": "Romania's president has withdrawn from the race to become NATO's next secretary general, leaving outgoing Dutch Prime Minister Mark Rutte all but certain to head the world's biggest military organization from October.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/romanias-president-exits-race-for-nato-chief-leavi/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "France's Macron and African leaders push for vaccines for Africa after COVID exposed inequalities\n",
    "publishedAt": "Thu, 20 Jun 2024 09:09:42 -0400",
    "description": "French President Emmanuel Macron is joining several African leaders on Thursday to kick off a planned $1 billion project to accelerate the rollout of vaccines in Africa, after the coronavirus pandemic exposed gaping inequalities in access to them.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/frances-macron-and-african-leaders-push-for-vaccin/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Defendant in Vatican trial takes case to U.N., accuses pope of violating rights with surveillance\n",
    "publishedAt": "Thu, 20 Jun 2024 08:59:27 -0400",
    "description": "One of the defendants in the Vatican's big financial trial has filed a formal complaint with the United Nations, alleging that Pope Francis violated his human rights by authorizing wide-ranging surveillance during the investigation.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/defendant-in-vatican-trial-takes-case-to-un-says-p/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": "Illegally brewed liquor kills at least 34 with dozens hospitalized in southern India\n",
    "publishedAt": "Thu, 20 Jun 2024 08:46:24 -0400",
    "description": "At least 34 people have died and dozens hospitalized after drinking illegally brewed liquor in the southern Indian state of Tamil Nadu, local media reported on Thursday.\n",
    "Publisher": "",
    "url": "https://www.washingtontimes.com/news/2024/jun/20/illegally-brewed-liquor-in-southern-india-kills-at/?utm_source=RSS_Feed\u0026utm_medium=RSS"
  },
  {
    "title": " French prime minister seeks to step out from Macron's shadow in the upcoming early election",
    "publishedAt": "Thu, 20 Jun 2024 09:58:34 -0400",
    "description": "France\u0026rsquo;s prime minister hopes to emerge from the campaign for the early legislative election not only still holding the job that President Emmanuel Macron gave him less than six months ago but also as more of his own person",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/french-prime-minister-seeks-step-macrons-shadow-upcoming-111275346"
  },
  {
    "title": " Russia obliterates front-line Ukraine towns by retrofitting bombs",
    "publishedAt": "Thu, 20 Jun 2024 12:06:16 -0400",
    "description": "Russia is intensifying its use of cheap glide bombs to lay waste to cities in eastern Ukraine",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/russia-obliterates-front-line-ukraine-towns-retrofitting-bombs-111266262"
  },
  {
    "title": " AP Week in Pictures: Latin America and Caribbean",
    "publishedAt": "Fri, 21 Jun 2024 00:22:28 -0400",
    "description": "\nJune 14-20, 2024\n\nIndigenous women in Ecuador take on soccer by inventing a sport: handball in traditional skirts.\n\nThousands of demonstrators took to the streets of Sao Paulo as protests sweep across Brazil in opposition to a bill that would further criminalize abortions. If passed, the law would equate the termination of a pregnancy after 22 weeks with homicide.\n\nPanama Canal authorities reported they will increase vessel transits through the interoceanic waterway following drought-related restrictions.\n\nTropical Storm Alberto formed in the southwestern Gulf of Mexico, the first named storm of what is forecast to be a busy hurricane season.\n\nThis gallery highlights some of the most compelling images made or published in the past week by The Associated Press from Latin America and the Caribbean. \n\nThe selection was curated by AP photo editor Anita Baca, based in Mexico City.\n\n___\n\nFollow AP visual journalism:\n\nAP Images blog: http://apimagesblog.com\n\nInstagram:...",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/ap-week-pictures-latin-america-caribbean-111302122"
  },
  {
    "title": " UK fans wonder if Taylor Swift will say 'So long, London' after Eras Tour",
    "publishedAt": "Fri, 21 Jun 2024 00:54:16 -0400",
    "description": "Taylor Swift fans enjoy parsing the singer-songwriter\u0026rsquo;s lyrics for references to her romantic life and insights into her state of her mind",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/uk-fans-taylor-swift-long-london-after-eras-111302402"
  },
  {
    "title": " 2 people killed when police clash with locals protesting pork processing plant in Mexico",
    "publishedAt": "Fri, 21 Jun 2024 01:01:48 -0400",
    "description": "Two people have been killed when locals protesting alleged water contamination by a pork processing plant clashed with police in the Mexican gulf coast state of Veracruz",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/2-people-killed-police-clash-locals-protesting-pork-111302520"
  },
  {
    "title": " Ukraine’s emergency blackouts return after Russia pounds infrastructure",
    "publishedAt": "Fri, 21 Jun 2024 02:32:01 -0400",
    "description": "Ukraine is experiencing rolling blackouts as Russia intensified strikes targeting energy infrastructure over the past three months",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/navigating-darkness-ukraines-emergency-blackouts-return-after-russia-111303051"
  },
  {
    "title": " Pakistan police probe mob that killed a man suspected of desecrating the Quran",
    "publishedAt": "Fri, 21 Jun 2024 05:58:26 -0400",
    "description": "Police in northwestern Pakistan have registered a case against hundreds of people who attacked a police station and killed a man being questioned there on suspicion of desecrating the Quran, Islam\u0026rsquo;s holy book",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/pakistan-police-register-case-mob-killed-man-suspected-111304385"
  },
  {
    "title": " Train collision in Chile kills at least 2 people and injures several others",
    "publishedAt": "Thu, 20 Jun 2024 18:06:18 -0400",
    "description": "Authorities in Chile say at least two rail workers were killed and nine others injured Thursday when a freight train collided head-on with another train on a test run just outside the capital of Chile",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/train-collision-chile-kills-2-people-injures-111268796"
  },
  {
    "title": " Seoul says South Korean soldiers fired warning shots after North Korean troops crossed border in 3rd crossing in June",
    "publishedAt": "Thu, 20 Jun 2024 23:18:02 -0400",
    "description": "Seoul says South Korean soldiers fired warning shots after North Korean troops crossed border in 3rd crossing in June",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/seoul-south-korean-soldiers-fired-warning-shots-after-111300828"
  },
  {
    "title": " It's hard to find treatment for snakebites in Kenya. Thousands of people are dying every year",
    "publishedAt": "Thu, 20 Jun 2024 05:02:16 -0400",
    "description": "Antivenom for snakebites can be hard to find in Kenya, where about 4,000 snakebite victims die every year",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/hard-find-treatment-snakebites-kenya-thousands-people-dying-111267228"
  },
  {
    "title": " Romania’s president pulls out of race to become next NATO chief, clearing way for Dutch Prime Minister Mark Rutte",
    "publishedAt": "Thu, 20 Jun 2024 09:02:07 -0400",
    "description": "Romania\u0026rsquo;s president pulls out of race to become next NATO chief, clearing way for Dutch Prime Minister Mark Rutte",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/romanias-president-pulls-race-become-nato-chief-clearing-111273308"
  },
  {
    "title": " Actor Ian McKellen, 85, offers thanks for messages of support after three nights in the hospital",
    "publishedAt": "Thu, 20 Jun 2024 10:22:15 -0400",
    "description": "Actor Ian McKellen is resting, taking light exercise and undergoing physiotherapy after spending three nights in the hospital after he toppled off a London stage during a fight scene earlier this week",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/actor-ian-mckellen-85-offers-messages-support-after-111274346"
  },
  {
    "title": " The Iberian lynx is back from the brink of extinction, thanks to conservation efforts",
    "publishedAt": "Thu, 20 Jun 2024 13:02:16 -0400",
    "description": "Things are looking up for the Iberian lynx",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/iberian-lynx-back-brink-extinction-conservation-efforts-111267348"
  },
  {
    "title": " As France reels from the rape of a Jewish girl, antisemitism comes to the fore in election campaign",
    "publishedAt": "Fri, 21 Jun 2024 05:26:30 -0400",
    "description": "The alleged rape of a 12-year-old Jewish girl in a suspected antisemitic attack has sent shockwaves throughout France, and thrust concerns about antisemitism to the forefront of campaigning for the country\u0026rsquo;s legislative elections",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/france-reels-rape-jewish-girl-antisemitism-fore-election-111282569"
  },
  {
    "title": " Thousands of refugees in Indonesia have spent years awaiting resettlement. Their future is unclear",
    "publishedAt": "Thu, 20 Jun 2024 05:02:27 -0400",
    "description": "Hundreds of refugees are living in community housing on an island in northwestern Indonesia while waiting for resettlement in a third country",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/thousands-refugees-indonesia-spent-years-awaiting-resettlement-future-111266746"
  },
  {
    "title": " Extreme heat in India has killed more than 100 people in the past three and a half months",
    "publishedAt": "Thu, 20 Jun 2024 08:30:24 -0400",
    "description": "Data from India's Health Ministry shows a monthslong heat wave across swathes of India has killed more than 100 people and led to over 40,000 suspected cases of heat stroke in the last three and a half months",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/extreme-heat-india-killed-100-people-past-half-111271458"
  },
  {
    "title": " The Putin-Kim summit produced an unusual — and speedy — flurry of glimpses into North Korea",
    "publishedAt": "Thu, 20 Jun 2024 17:26:42 -0400",
    "description": "The imagery from Pyongyang emerged quickly this week and was notable in its variety",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/putin-kim-summit-produced-unusual-speedy-flurry-glimpses-111291526"
  },
  {
    "title": " The Latest | Armenia recognizes a Palestinian state, and Israel summons its ambassador",
    "publishedAt": "Fri, 21 Jun 2024 06:38:15 -0400",
    "description": "The U.S. military says a floating pier it built in Gaza has been reattached to the shore and is unloading humanitarian aid again",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/latest-armenia-recognizes-palestinian-state-israel-summons-ambassador-111304599"
  },
  {
    "title": " Argentina's president promises to quash corruption then shocks with his Supreme Court pick",
    "publishedAt": "Fri, 21 Jun 2024 00:35:40 -0400",
    "description": "Campaigning last year as a libertarian outsider in the presidential race, Javier Milei electrified crowds with his vows to destroy Argentina\u0026rsquo;s corrupt political elite",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/argentinas-president-promises-quash-corruption-shocks-supreme-court-111302110"
  },
  {
    "title": " Illegally brewed liquor kills at least 34 with dozens hospitalized in southern India",
    "publishedAt": "Thu, 20 Jun 2024 16:06:28 -0400",
    "description": "Officials say at least 34 people have died and dozens are hospitalized after drinking illegally brewed liquor tainted with methanol in the southern Indian state of Tamil Nadu",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/illegally-brewed-liquor-kills-29-dozens-hospitalized-southern-111265781"
  },
  {
    "title": " Darfur sees an increase in much needed food aid, but it’s still not enough to avert famine, UN says",
    "publishedAt": "Thu, 20 Jun 2024 17:18:47 -0400",
    "description": "The U.N.'s food agency says families in Sudan\u0026rsquo;s embattled western Darfur region have received an emergency increase in food aid that is needed to help avert looming famine",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/darfur-sees-increase-needed-food-aid-avert-famine-111294190"
  },
  {
    "title": " Germany and Dutch-owned operator end talks on grid sale because of budget constraints",
    "publishedAt": "Thu, 20 Jun 2024 06:22:14 -0400",
    "description": "A state-owned Dutch company that is the biggest electricity grid operator in Germany says talks on selling its German business to the government in Berlin have been terminated due to the administration\u0026rsquo;s budget constraints",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/germany-dutch-owned-operator-end-talks-grid-sale-111267240"
  },
  {
    "title": " Czech man arrested in Croatia after explosion kills his 9-year-old child",
    "publishedAt": "Fri, 21 Jun 2024 06:21:59 -0400",
    "description": "A Czech man has been detained in Croatia for allegedly allowing his 9-year-old child to take an explosive device from a military zone which later killed him",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/czech-man-arrested-croatia-after-explosion-kills-9-111304387"
  },
  {
    "title": " Russia-North Korea pact could dent China's influence, but Beijing still holds sway over both",
    "publishedAt": "Fri, 21 Jun 2024 06:30:15 -0400",
    "description": "China appears to be keeping its distance as Russia and North Korea move closer to each other with a new defense pact that could tilt the balance of power among the three authoritarian states",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/russia-north-korea-pact-dent-chinas-influence-beijing-111303599"
  },
  {
    "title": " Germany arrests a man accused of standing by to carry out attacks for IS",
    "publishedAt": "Thu, 20 Jun 2024 06:26:19 -0400",
    "description": "Prosecutors say an Iraqi man who is accused of standing by to carry out attacks for the Islamic State group after he arrived in Germany in 2022 has been arrested",
    "Publisher": "",
    "url": "https://abcnews.go.com/International/wireStory/germany-arrests-man-accused-standing-carry-attacks-islamic-111267720"
  },
  {
    "title": "Impassioned Question Time audience puts leaders on the spot",
    "publishedAt": "Fri, 21 Jun 2024 00:27:59 GMT",
    "description": "The BBC's chief political correspondent analyses the key moments of Thursday's Leaders' Special.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cnddj9g1d5ko"
  },
  {
    "title": "Chief constable who lied about naval rank dismissed",
    "publishedAt": "Fri, 21 Jun 2024 10:26:16 GMT",
    "description": "Nick Adderley says the decision brings an “end to my career of over 32 years as a police officer”.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/ceqq74pg1evo"
  },
  {
    "title": "Top sunscreens fail protection tests, Which? says",
    "publishedAt": "Fri, 21 Jun 2024 01:53:45 GMT",
    "description": "Some cheaper lotions from supermarkets Aldi and Lidl outperformed more expensive brands, Which? said.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cgeevnvj997o"
  },
  {
    "title": "'We all love you so much' - Kate's birthday tribute to William",
    "publishedAt": "Fri, 21 Jun 2024 10:04:54 GMT",
    "description": "The image was posted online by the Princess of Wales to mark her husband's 42nd birthday. ",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/clwwe80dwpeo"
  },
  {
    "title": "Jay Slater: Search for missing Brit focuses on ravine",
    "publishedAt": "Fri, 21 Jun 2024 10:15:08 GMT",
    "description": "Jay Slater has been missing since shortly before 09:00 BST on Monday.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cpdd3l84zk0o"
  },
  {
    "title": "London hospitals hackers publish stolen blood test data",
    "publishedAt": "Fri, 21 Jun 2024 07:15:16 GMT",
    "description": "The gang shared almost 400GB of the private information on their darknet site and Telegram channel.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c9ww90j9dj8o"
  },
  {
    "title": "Rob Burrow recorded video messages to be played as children grow up",
    "publishedAt": "Fri, 21 Jun 2024 02:23:09 GMT",
    "description": "The MND campaigner's messages are for his children in the future, his wife told BBC Breakfast.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cw00z7wdnwro"
  },
  {
    "title": "Naked swimmers mark Australia's winter solstice",
    "publishedAt": "Fri, 21 Jun 2024 09:23:00 GMT",
    "description": "Around 3,000 people took the plunge in the River Derwent in Hobart to mark the winter solstice.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/videos/c4nn7y74m2po"
  },
  {
    "title": "Ex-footballer Roberto Baggio injured in armed robbery",
    "publishedAt": "Fri, 21 Jun 2024 10:01:06 GMT",
    "description": "The veteran footballer received stitches to his head after an armed robbery at his villa in northern Italy.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c99942qkny4o"
  },
  {
    "title": "North Korea building border ‘wall’, satellite images reveal",
    "publishedAt": "Thu, 20 Jun 2024 23:59:34 GMT",
    "description": "North Korea is building sections of what appears to be a wall in several places near its border with South Korea, new satellite images show.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c2qq7x594vqo"
  },
  {
    "title": "Government borrowing in May is highest since Covid",
    "publishedAt": "Fri, 21 Jun 2024 09:34:50 GMT",
    "description": "Borrowing reaches £15bn, less than forecast but lays bare challenges facing the next government. ",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cmll7k8pl2xo"
  },
  {
    "title": "Putin warns South Korea against arming Ukraine",
    "publishedAt": "Fri, 21 Jun 2024 06:50:08 GMT",
    "description": "The Russian president said it would be a \"big mistake\" if Seoul sent lethal weapons to Kyiv.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c1ee8x221lno"
  },
  {
    "title": "Who should I vote for and what are the parties promising?",
    "publishedAt": "Fri, 21 Jun 2024 09:57:37 GMT",
    "description": "Explore parties’ 2024 election manifestos and compare their policies on issues from housing to immigration with this interactive guide from BBC News.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cxeez8271nvo"
  },
  {
    "title": "BBC Question Time election debate fact-checked",
    "publishedAt": "Thu, 20 Jun 2024 21:47:02 GMT",
    "description": "BBC Verify examines claims on spending, migration, Brexit, and the NHS, among other issues.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c844dp1yg1lo"
  },
  {
    "title": "Key takeaways from BBC Question Time election special",
    "publishedAt": "Thu, 20 Jun 2024 22:24:31 GMT",
    "description": "Just two weeks from election day, party leaders face tough questions from a BBC Question Time audience.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c6ppe90y9rgo"
  },
  {
    "title": "Corbyn would have been better PM than Johnson - Keir Starmer",
    "publishedAt": "Thu, 20 Jun 2024 22:57:02 GMT",
    "description": "Sir Keir Starmer was among four leaders to face a grilling from a BBC Question Time audience. ",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cn00dlzexevo"
  },
  {
    "title": "Newscast",
    "publishedAt": "Thu, 20 Jun 2024 22:32:00 GMT",
    "description": "Adam, Chris and Alex unpack the Leaders’ Question Time performance",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/sounds/play/p0j5k6tw"
  },
  {
    "title": "Who can I vote for in the general election?",
    "publishedAt": "Mon, 10 Jun 2024 14:53:49 GMT",
    "description": "Find out which constituency you are in, who you can vote for and where you can vote using our postcode search.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cw55nk6yn01o"
  },
  {
    "title": "Sir John Curtice: Can we trust polls predicting a Tory ‘wipeout'?",
    "publishedAt": "Thu, 20 Jun 2024 18:34:31 GMT",
    "description": "Are the Conservatives really on course for an election 'wipeout'? Or should we be sceptical about the polls?",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cv22y07ggy6o"
  },
  {
    "title": "Election poll tracker: How do the parties compare?",
    "publishedAt": "Fri, 21 Jun 2024 09:27:05 GMT",
    "description": "How do people say they will vote in the UK general election? Our poll tracker measures the trends.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/uk-politics-68079726"
  },
  {
    "title": "What are the parties saying about housing? - Your questions",
    "publishedAt": "Thu, 20 Jun 2024 16:50:50 GMT",
    "description": "Our cost of living correspondent answers your questions about housing and personal finance.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cpdd30xk04ko"
  },
  {
    "title": "What photo ID will you need to vote in the general election?",
    "publishedAt": "Thu, 20 Jun 2024 11:38:08 GMT",
    "description": "Everyone voting in person at the general election on 4 July will have to show valid photo ID.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/explainers-64877005"
  },
  {
    "title": "Which battleground seats are Labour targeting?",
    "publishedAt": "Thu, 20 Jun 2024 12:35:55 GMT",
    "description": "The places Labour is aiming to win at the general election.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c133p016pg4o"
  },
  {
    "title": "Scottish Greens manifesto: Key policies analysed",
    "publishedAt": "Thu, 20 Jun 2024 18:09:20 GMT",
    "description": "The Scottish Greens promise to \"turbo charge\" Scotland's journey to net zero.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cevv9dkwekeo"
  },
  {
    "title": "Alliance Party manifesto: Key policies analysed",
    "publishedAt": "Thu, 20 Jun 2024 11:04:37 GMT",
    "description": "The Alliance Party launches its 2024 election manifesto, setting out the party's plans.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cmll7epxy3xo"
  },
  {
    "title": "SNP manifesto: 11 key policies analysed",
    "publishedAt": "Wed, 19 Jun 2024 21:53:42 GMT",
    "description": "BBC correspondents analyse key policies in the SNP manifesto.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c3ggl375nn7o"
  },
  {
    "title": "Muslim millionaire gives major donation to Reform UK",
    "publishedAt": "Thu, 20 Jun 2024 01:33:29 GMT",
    "description": "As well as being a donor, Zia Yusuf will also have a public role for Reform UK during the campaign.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cd11xxn833yo"
  },
  {
    "title": "Henry Zeffman: Will falling inflation change minds on the campaign trail?",
    "publishedAt": "Wed, 19 Jun 2024 16:04:01 GMT",
    "description": "Henry Zeffman: Will falling inflation change minds on the campaign trail?",
    "Publisher": "",
    "url": "https://www.bbc.com/news/videos/ck7794dygzxo"
  },
  {
    "title": "Sinn Féin manifesto: Key policies analysed",
    "publishedAt": "Wed, 19 Jun 2024 15:52:46 GMT",
    "description": "BBC News NI correspondents examine the detail of Sinn Féin's manifesto for the general election.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cz99e3gk6l9o"
  },
  {
    "title": "Sinn Féin: Election must bring 'change' in NI funding",
    "publishedAt": "Wed, 19 Jun 2024 16:08:28 GMT",
    "description": "Mary Lou McDonald was speaking at the launch of Sinn Féin's manifesto for the UK general election.\n\n",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cpww78ywq8eo"
  },
  {
    "title": "Labour would need an effective opposition, says Hunt",
    "publishedAt": "Wed, 19 Jun 2024 17:34:23 GMT",
    "description": "The chancellor is the latest senior Tory to acknowledge his party could be on course for defeat. ",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c033qqme69po"
  },
  {
    "title": "Who can I vote for in the general election?",
    "publishedAt": "Mon, 10 Jun 2024 14:53:49 GMT",
    "description": "Find out which constituency you are in, who you can vote for and where you can vote using our postcode search.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cw55nk6yn01o"
  },
  {
    "title": "From villains to lovers - Donald Sutherland played them all",
    "publishedAt": "Thu, 20 Jun 2024 17:26:56 GMT",
    "description": "The Canadian actor had a prolific screen career that included roles in Don't Look Now and The Hunger Games.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/entertainment-arts-52070783"
  },
  {
    "title": "If a university goes bust, which students lose most?",
    "publishedAt": "Thu, 20 Jun 2024 23:19:40 GMT",
    "description": "Whoever forms the next government is going to find it hard to ignore the issue of university funding",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cv22y7zl18po"
  },
  {
    "title": "Weekly quiz: Which troops turned out for Catherine on the King's birthday?",
    "publishedAt": "Thu, 20 Jun 2024 17:33:02 GMT",
    "description": "Test how closely you have been paying attention to what has been going on over the past seven days.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/world-69135286"
  },
  {
    "title": "Macron's hometown voters look set to shun the president",
    "publishedAt": "Fri, 21 Jun 2024 05:00:51 GMT",
    "description": "Residents of Mr Macron's hometown have turned their back on him ahead of France's snap elections.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cy77z0xjvjjo"
  },
  {
    "title": "Egyptian pilgrims 'totally abandoned' in Hajj heat",
    "publishedAt": "Thu, 20 Jun 2024 19:14:14 GMT",
    "description": "With hundreds thought dead, one victim's family say unregistered pilgrims have been failed by travel agents.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cxrrzp479r4o"
  },
  {
    "title": "Marvel star Karen Gillan is not scared of being cancelled ",
    "publishedAt": "Fri, 21 Jun 2024 05:10:45 GMT",
    "description": "Scots actress Karen Gillan's new role made her face up to the pitfalls of social media.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c9rr5ewl73lo"
  },
  {
    "title": "When is the first debate between Biden and Trump?",
    "publishedAt": "Thu, 20 Jun 2024 21:59:33 GMT",
    "description": "The Democratic president and his Republican predecessor will meet  on a debate stage for the first time in four years.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cekke335z9ko"
  },
  {
    "title": "The awkward questions behind Hungary's football revival",
    "publishedAt": "Thu, 20 Jun 2024 21:40:57 GMT",
    "description": "Hungary have ridden back into contention for international honours on the back of billions of euros and one man's passion for football. ",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/cekk4zp5rg8o"
  },
  {
    "title": "'Baffling and concerning' - what is wrong with England?",
    "publishedAt": "Thu, 20 Jun 2024 21:03:21 GMT",
    "description": "England's draw with Denmark was \"baffling and concerning\" according to the pundits, but what exactly is going wrong for the Three Lions?",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/cx88z951lxgo"
  },
  {
    "title": "Highlights: England play out frustrating 1-1 draw with Denmark",
    "publishedAt": "Thu, 20 Jun 2024 18:00:49 GMT",
    "description": "Watch highlights as England play out a frustrating 1-1 draw with Denmark in their second Group C game of Euro 2024 in Frankfurt. ",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/videos/c722041y9dgo"
  },
  {
    "title": "Uefa Euro 2024 TV schedule",
    "publishedAt": "Thu, 20 Jun 2024 21:44:43 GMT",
    "description": "Throughout Euro 2024 BBC Sport will update this page with your channel guide for each game.",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/crgg298849mo"
  },
  {
    "title": "China is the true power in Putin and Kim’s budding friendship",
    "publishedAt": "Wed, 19 Jun 2024 13:55:21 GMT",
    "description": "There are signs President Xi disapproves of his allies' alliance, the BBC's China correspondent says.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c1vv196pe3eo"
  },
  {
    "title": "Bar chart wars: What to watch out for on leaflets telling you who can win your seat",
    "publishedAt": "Tue, 18 Jun 2024 23:03:20 GMT",
    "description": "It’s a two-horse race here, leaflets put out by political parties often claim. Can you trust them?",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c722gl8rzdro"
  },
  {
    "title": "Faisal Islam: Voters are being taken for fools on the economy",
    "publishedAt": "Tue, 18 Jun 2024 15:05:51 GMT",
    "description": "Do promises to leave various tax rates alone have any credibility, asks the BBC's economics editor.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/crgg4ze1edpo"
  },
  {
    "title": "Gaza, Ukraine, China - the next PM faces a crowded agenda on foreign affairs",
    "publishedAt": "Sun, 16 Jun 2024 23:18:15 GMT",
    "description": "For all the focus on domestic issues, there will be plenty for whoever becomes PM to focus on abroad",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c255wyvgz9zo"
  },
  {
    "title": "Pope told off by student for using anti-LGBTQ language",
    "publishedAt": "Fri, 21 Jun 2024 09:19:18 GMT",
    "description": "It comes after reports that the Pope used extremely offensive language against gay men in a meeting.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c7220y9jx04o"
  },
  {
    "title": "Stonehenge solstice sunrise attracts 15,000 people",
    "publishedAt": "Fri, 21 Jun 2024 07:40:56 GMT",
    "description": "People have gathered at the ancient site in Wiltshire on the longest day of the year.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c7224qlenmeo"
  },
  {
    "title": "Chimpanzees ‘self-medicate’ with healing plants",
    "publishedAt": "Thu, 20 Jun 2024 23:59:17 GMT",
    "description": "Wild chimpanzees seek out medicinal plants to eat when they are sick or injured, a study says.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/ce994dv9q4eo"
  },
  {
    "title": "NZ woman sues partner for not taking her to airport",
    "publishedAt": "Fri, 21 Jun 2024 08:51:42 GMT",
    "description": "New Zealand's Disputes Tribunal dismissed the claim, saying the promises did not constitute a contract.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c3ggk2k1eppo"
  },
  {
    "title": "Wales sack manager Page",
    "publishedAt": "Fri, 21 Jun 2024 09:14:56 GMT",
    "description": "Wales sack manager Rob Page following the team's failure to qualify for Euro 2024 and recent poor performances.",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/c877mp1852po"
  },
  {
    "title": "Passion, pilots and panache: Africa's top shots",
    "publishedAt": "Thu, 20 Jun 2024 23:43:26 GMT",
    "description": "A selection of the week's best photos from across the African continent.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/czrrz33z70jo"
  },
  {
    "title": "Warning over tax being paid on state pension",
    "publishedAt": "Thu, 20 Jun 2024 23:11:46 GMT",
    "description": "Tax on pensions is a key issue raised by you through the BBC's Your Voice, Your Vote project.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/ckdd40vdg5zo"
  },
  {
    "title": "Wales sack manager Page",
    "publishedAt": "Fri, 21 Jun 2024 09:14:56 GMT",
    "description": "Wales sack manager Rob Page following the team's failure to qualify for Euro 2024 and recent poor performances.",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/c877mp1852po"
  },
  {
    "title": "'England are about to really feel the pressure'",
    "publishedAt": "Fri, 21 Jun 2024 06:01:03 GMT",
    "description": "Ex-England captain Alan Shearer explains why it is better for Three Lions players to stay in the bubble at their team camp to deal with criticism over their performances at Euro 2024.",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/c4nnm8550jro"
  },
  {
    "title": "Child star, social media icon - time to shine at Euro 2024?",
    "publishedAt": "Fri, 21 Jun 2024 06:54:10 GMT",
    "description": "Child star, teen social media icon and now wanted by Europe's top clubs, is it tim for Xavi Simons to star for Netherlands at Euro 2024?",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/c3gg9lyn7q9o"
  },
  {
    "title": "Scouting with Moyes - 'Here as a fan, but I think like a manager'",
    "publishedAt": "Fri, 21 Jun 2024 10:15:10 GMT",
    "description": "Former West Ham manager David Moyes on watching new players at Euro 2024 and how the latest generation of coaches means the game is always evolving.",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/c6ppe1yr59wo"
  },
  {
    "title": "Cummins takes hat-trick at T20 World Cup",
    "publishedAt": "Fri, 21 Jun 2024 08:24:37 GMT",
    "description": "Australia bowler Pat Cummins takes a hat-trick of wickets against Bangladesh in the Super 8 stage of the T20 World Cup.",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/cricket/videos/cy00zdgmy7mo"
  },
  {
    "title": "Download now",
    "publishedAt": "Tue, 13 Jun 2023 10:25:22 GMT",
    "description": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/10628994"
  },
  {
    "title": "Electioncast: Question Time Leaders' Debate (Analysis!)",
    "publishedAt": "Thu, 20 Jun 2024 22:32:00 GMT",
    "description": "Adam, Chris and Alex unpack the Leaders’ Question Time performance",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/sounds/play/p0j5k6tw"
  },
  {
    "title": "Ukraine war: The men avoiding conscription",
    "publishedAt": "Thu, 20 Jun 2024 08:50:00 GMT",
    "description": "Many draft-eligible Ukrainians are hiding from mobilisation squads",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct6dt2"
  },
  {
    "title": "How does government borrowing work?",
    "publishedAt": "Tue, 23 Apr 2024 09:17:23 GMT",
    "description": "How does government borrowing work, and how and when is the money paid back?",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-50504151"
  },
  {
    "title": "When will mortgage rates come down?",
    "publishedAt": "Thu, 20 Jun 2024 13:58:41 GMT",
    "description": "Bank of England interest rates affect mortgage, loan and savings rates for millions of people.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-57764601"
  },
  {
    "title": "How quickly are prices rising in the UK?",
    "publishedAt": "Thu, 20 Jun 2024 11:17:36 GMT",
    "description": "The rate at which prices are rising has fallen from record highs, meeting the 2% target.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-12196322"
  },
  {
    "title": "Five ways to save money on your mortgage",
    "publishedAt": "Mon, 08 Jan 2024 09:53:55 GMT",
    "description": "Experts give advice for those who might be worried about their monthly mortgage payments.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-65984415"
  },
  {
    "title": "When will mortgage rates come down?",
    "publishedAt": "Thu, 20 Jun 2024 13:58:41 GMT",
    "description": "Bank of England interest rates affect mortgage, loan and savings rates for millions of people.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-57764601"
  },
  {
    "title": "How quickly are prices rising in the UK?",
    "publishedAt": "Thu, 20 Jun 2024 11:17:36 GMT",
    "description": "The rate at which prices are rising has fallen from record highs, meeting the 2% target.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-12196322"
  },
  {
    "title": "Five ways to save money on your mortgage",
    "publishedAt": "Mon, 08 Jan 2024 09:53:55 GMT",
    "description": "Experts give advice for those who might be worried about their monthly mortgage payments.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-65984415"
  },
  {
    "title": "Five hacks to help save money on your food shop",
    "publishedAt": "Wed, 29 Nov 2023 15:53:08 GMT",
    "description": "The cost-of-living crisis continues to bite. Here are some things that can reduce the impact.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/uk-61798003"
  },
  {
    "title": "Three ways to win the rental property race",
    "publishedAt": "Tue, 14 May 2024 23:30:47 GMT",
    "description": "From being first in the queue to being more flexible, here are some tips on how to get ahead in the rental race.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-65089308"
  },
  {
    "title": "Five hacks to help save money on your food shop",
    "publishedAt": "Wed, 29 Nov 2023 15:53:08 GMT",
    "description": "The cost-of-living crisis continues to bite. Here are some things that can reduce the impact.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/uk-61798003"
  },
  {
    "title": "When will mortgage rates come down?",
    "publishedAt": "Thu, 20 Jun 2024 13:58:41 GMT",
    "description": "Bank of England interest rates affect mortgage, loan and savings rates for millions of people.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-57764601"
  },
  {
    "title": "Five ways to save money on your mortgage",
    "publishedAt": "Mon, 08 Jan 2024 09:53:55 GMT",
    "description": "Experts give advice for those who might be worried about their monthly mortgage payments.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-65984415"
  },
  {
    "title": "Three ways to win the rental property race",
    "publishedAt": "Tue, 14 May 2024 23:30:47 GMT",
    "description": "From being first in the queue to being more flexible, here are some tips on how to get ahead in the rental race.",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-65089308"
  },
  {
    "title": "Fact v fiction: Five tips for saving petrol money examined",
    "publishedAt": "Mon, 03 Jul 2023 13:01:34 GMT",
    "description": "With weak competition adding to fuel prices, are drivers doing the right things to save money?",
    "Publisher": "",
    "url": "https://www.bbc.co.uk/news/business-61745697"
  },
  {
    "title": "Chief constable who lied about naval rank dismissed",
    "publishedAt": "Fri, 21 Jun 2024 10:26:16 GMT",
    "description": "Nick Adderley says the decision brings an “end to my career of over 32 years as a police officer”.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/ceqq74pg1evo"
  },
  {
    "title": "DUP leader plays down fears over parade",
    "publishedAt": "Thu, 20 Jun 2024 23:05:56 GMT",
    "description": "DUP leader Gavin Robinson said he did not detect an “appetite” for trouble and hoped a resolution could be found.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/c9xx6e8lp1wo"
  },
  {
    "title": "Why are devolved issues dominating a UK election?",
    "publishedAt": "Fri, 21 Jun 2024 05:09:45 GMT",
    "description": "The vote is a UK general election, and thus will not directly affect how some services are delivered here.",
    "Publisher": "",
    "url": "https://www.bbc.com/news/articles/cjrr1z51y0jo"
  },
  {
    "title": "Wales sack manager Page",
    "publishedAt": "Fri, 21 Jun 2024 09:14:56 GMT",
    "description": "Wales sack manager Rob Page following the team's failure to qualify for Euro 2024 and recent poor performances.",
    "Publisher": "",
    "url": "https://www.bbc.com/sport/football/articles/c877mp1852po"
  },
  {
    "title": "Barry Bonds 'knew I needed to come' to Rickwood Field for Willie Mays",
    "publishedAt": "2024-06-21T01:43:14Z",
    "description": "Barry Bonds 'knew I needed to come' to Rickwood Field for Willie Mays",
    "Publisher": "",
    "url": "/story/sports/mlb/2024/06/20/willie-mays-barry-bonds-godson-rickwood-field/74163959007/"
  },
  {
    "title": "Suspect in multiple Oklahoma, Alabama killings arrested in Arkansas",
    "publishedAt": "2024-06-21T10:21:57Z",
    "description": "Suspect in multiple Oklahoma, Alabama killings arrested in Arkansas",
    "Publisher": "",
    "url": "/story/news/nation/2024/06/21/stacy-lee-drake-homicides-oklahoma-alabama-arrested/74165414007/"
  },
  {
    "title": "Donald Sutherland, star of 'M*A*S*H,' 'Hunger Games,' dies at 88",
    "publishedAt": "2024-06-20T21:44:28Z",
    "description": "Donald Sutherland, star of 'M*A*S*H,' 'Hunger Games,' dies at 88",
    "Publisher": "",
    "url": "/story/entertainment/movies/2024/06/20/donald-sutherland-dead/9126944002/"
  },
  {
    "title": "Does J.J. Redick have secret to success with LeBron, Lakers?",
    "publishedAt": "2024-06-21T10:31:13Z",
    "description": "Does J.J. Redick have secret to success with LeBron, Lakers?",
    "Publisher": "",
    "url": "/story/sports/nba/columnist/jeff-zillgitt/2024/06/20/jj-redick-lakers-coach-lebron/74163545007/"
  },
  {
    "title": "After wildfires ravage Ruidoso, New Mexico, floods swamp area; 2 dead",
    "publishedAt": "2024-06-20T17:56:24Z",
    "description": "After wildfires ravage Ruidoso, New Mexico, floods swamp area; 2 dead",
    "Publisher": "",
    "url": "/story/news/nation/2024/06/20/new-mexico-wildfires-ruidoso-floods/74155528007/"
  },
  {
    "title": "USC student won't face charges in fatal stabbing near campus. Why?",
    "publishedAt": "2024-06-21T03:38:57Z",
    "description": "USC student won't face charges in fatal stabbing near campus. Why?",
    "Publisher": "",
    "url": "/story/news/nation/2024/06/20/usc-student-fatal-stabbing-no-charges/74162395007/"
  },
  {
    "title": "2 Flight attendants fall mysteriously ill from 'unknown odor' on plane",
    "publishedAt": "2024-06-20T18:56:48Z",
    "description": "2 Flight attendants fall mysteriously ill from 'unknown odor' on plane",
    "Publisher": "",
    "url": "/story/travel/airline-news/2024/06/20/alaska-airlines-flight-attendants-unknown-odor-ill/74153657007/"
  },
  {
    "title": "Olympic champion Tara Lipinski talks infertility journey: 'Something that I carry with me'",
    "publishedAt": "2024-06-20T15:58:59Z",
    "description": "Olympic champion Tara Lipinski talks infertility journey: 'Something that I carry with me'",
    "Publisher": "",
    "url": "/story/life/health-wellness/2024/06/20/tara-lipinski-infertility-journey/74134178007/"
  },
  {
    "title": "Ryan Garcia suspended, win over Devin Haney declared no contest",
    "publishedAt": "2024-06-20T23:55:24Z",
    "description": "Ryan Garcia suspended, win over Devin Haney declared no contest",
    "Publisher": "",
    "url": "/story/sports/boxing/2024/06/20/ryan-garcia-suspended-failed-drug-test-devin-haney-no-contest/74163795007/"
  },
  {
    "title": "567,000 portable chargers sold at Costco recalled for fire concerns",
    "publishedAt": "2024-06-21T02:19:14Z",
    "description": "567,000 portable chargers sold at Costco recalled for fire concerns",
    "Publisher": "",
    "url": "/story/money/2024/06/20/portable-chargers-recall-mycharge-power-hub-all-in-one-10000mah/74164578007/"
  },
  {
    "title": "You doubted Angel Reese? Don't you look foolish now",
    "publishedAt": "2024-06-20T21:00:11Z",
    "description": "You doubted Angel Reese? Don't you look foolish now",
    "Publisher": "",
    "url": "/story/sports/columnist/nancy-armour/2024/06/20/angel-reese-knew-her-game-would-translate-to-wnba/74161346007/"
  }
]