[{"title":"Republicans in Congress press for answers about unsafe conditions in Army barracks\n","publishedAt":"Wed, 03 Jul 2024 11:46:12 -0400","description":"A dozen GOP House lawmakers are pressing the Army's top civilian and military leaders for information about substandard conditions inside the service's barracks, which they say pose health risks to the troops and hurt the Army's recruiting and retention efforts.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/republicans-in-congress-press-for-answers-about-un/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Chinese seizure of Taiwanese fishing boat seen as part of troubling pattern\n","publishedAt":"Wed, 03 Jul 2024 10:46:42 -0400","description":"Chinese forces seized a Taiwanese fishing boat in the ill-defined waters off the island of Kinmen late Tuesday night and took the vessel to a Chinese port, Taiwanese news outlets reported Wednesday, the latest aggressive move short of outright combat by Beijing against the island democracy it claims as part of its sovereign territory.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/chinese-seizure-of-taiwanese-fishing-boat-seen-as-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Any port in a storm: Iconic, decrepit SS United States seeks new home after Philly eviction\n","publishedAt":"Wed, 03 Jul 2024 10:13:16 -0400","description":"In its day, the SS United States was a nautical marvel, the fastest passenger liner to cross the Atlantic Ocean in a record time that has stood for more than 70 years. But the only race the vessel known as \"America's flagship\" is competing in now is a race against time to avoid the scrapyard.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/any-port-in-storm-iconic-decrepit-ss-united-states/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Italy appeals court to rule on fate of 2 Americans in 2019 death of Rome police officer\n","publishedAt":"Wed, 03 Jul 2024 09:38:03 -0400","description":"Two American men convicted in the slaying of an Italian plainclothes police officer during a botched sting operation faced another verdict on Wednesday in a new trial after Italy's highest court threw out their convictions.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/italy-appeals-court-to-decide-fate-of-2-americans-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"EU commission approves Lufthansa purchase of long-troubled Italian airline ITA, with conditions\n","publishedAt":"Wed, 03 Jul 2024 09:35:29 -0400","description":"The European Commission on Wednesday approved Lufthansa's takeover of Italian airline ITA with conditions to protect competition in a deal that Italy's finance minister called \"historic.\"\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/eu-commission-oks-lufthansa-purchase-of-long-troub/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Settlement tracking group says Israel has made largest West Bank land seizure in 3 decades\n","publishedAt":"Wed, 03 Jul 2024 09:22:55 -0400","description":"Israel has approved the largest seizure of land in the occupied West Bank in over three decades, a settlement tracking group said Wednesday, a move that could further worsen already soaring tensions linked to the ongoing war in Gaza.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/israel-has-made-largest-west-bank-land-seizure-in-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Tunisia sets elections for October. The increasingly authoritarian president hasn't said he'll run\n","publishedAt":"Wed, 03 Jul 2024 09:02:27 -0400","description":"Tunisia's increasingly authoritarian leader has scheduled the next presidential election for October without saying whether he will seek a second term after five tumultuous years at the head of the North African nation once seen as a model of democracy for the Arab world.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/tunisia-sets-elections-for-october-but-increasingl/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"German police investigate video that appears to show Euro 2024 security punching and kicking a fan\n","publishedAt":"Wed, 03 Jul 2024 09:02:17 -0400","description":"Police in the German city of Frankfurt are investigating a video that appears to show a fan being punched and kicked while being detained by a group of Euro 2024 security personnel at Portugal's game with Slovenia.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/germany-police-investigate-video-that-appears-to-s/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Russian missiles and drones strike eastern Ukraine's Dnipro in a daylight attack that kills 5\n","publishedAt":"Wed, 03 Jul 2024 08:47:41 -0400","description":"A Russian missile and drone attack on the eastern Ukrainian city of Dnipro on Wednesday killed five civilians and injured 47 others, including a 14-year-old girl, authorities said.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/russian-missiles-drones-strike-eastern-ukraines-dn/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"The Belarus president says some seriously ill political prisoners will be released\n","publishedAt":"Wed, 03 Jul 2024 08:42:07 -0400","description":"President Alexander Lukashenko of Belarus announced Tuesday that he will release some seriously ill political prisoners who were jailed during protests against his authoritarian rule in 2020.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/belarus-president-alexander-lukashenko-says-some-s/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"New Dutch leader pledges to cut immigration as the opposition vows to root out racists in cabinet\n","publishedAt":"Wed, 03 Jul 2024 08:28:16 -0400","description":"Dutch Prime Minister Dick Schoof gave his first speech to parliament on Wednesday, pledging that he will work hard at one of his new goverment's main aims: reducing immigration.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/new-dutch-leader-vows-to-cut-immigration-as-opposi/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Egypt swears in a new Cabinet as mounting economic challenges fuel public discontent\n","publishedAt":"Wed, 03 Jul 2024 08:15:03 -0400","description":"Egypt's new Cabinet was sworn in Wednesday as the country faces an ailing economy and raging conflicts in neighboring nations.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/egypts-new-cabinet-sworn-in-as-mounting-economic-c/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Mosaics by an artist accused of abusing women will stay on the Lourdes shrine, for now\n","publishedAt":"Wed, 03 Jul 2024 07:50:45 -0400","description":"A French bishop has put off any decision on whether to remove mosaics by an ex-Jesuit artist accused of abusing women, saying that they'll stay for now on the Lourdes shrine but that eventually they should be removed.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/mosaics-by-artist-accused-of-abusing-women-to-stay/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Missing nuts and bolts caused last year's deadly construction elevator accident in Sweden\n","publishedAt":"Wed, 03 Jul 2024 07:31:28 -0400","description":"A construction elevator that killed five people when it collapsed last year in Stockholm was missing the bolts that were supposed to hold its mast together, authorities said Wednesday.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/missing-nuts-and-bolts-caused-2023-deadly-construc/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Former Northern Ireland unionist leader ordered to stand trial for alleged sex offenses\n","publishedAt":"Wed, 03 Jul 2024 07:09:24 -0400","description":"A judge on Wednesday ordered the former leader of Northern Ireland's biggest unionist party to stand trial on charges of rape and sexual offenses.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/jeffrey-donaldson-former-northern-ireland-unionist/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"A French citizen pleads guilty to charges of collecting military data in Russia, state media say\n","publishedAt":"Wed, 03 Jul 2024 06:42:58 -0400","description":"A French citizen arrested in Russia has pleaded guilty to criminal charges involving illegally collecting information on military issues in the country, state news agency Tass said Wednesday.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/french-citizen-arrested-in-russia-pleads-guilty-to/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Severe overcrowding, lack of exits and mud contributed to a deadly stampede in India\n","publishedAt":"Wed, 03 Jul 2024 06:25:07 -0400","description":"Severe overcrowding and a lack of exits contributed to a stampede at a religious festival in northern India, authorities said Wednesday, leaving at least 121 people dead as the faithful surged toward the preacher to touch him and chaos ensued.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/overcrowding-lack-of-exits-and-mud-contributed-to-/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"At least 7 arrested in Germany and Sweden on suspicion of committing war crimes in Syria\n","publishedAt":"Wed, 03 Jul 2024 06:14:05 -0400","description":"At least seven people have been arrested in Germany and Sweden on suspicion of committing crimes against humanity and war crimes in Syria in 2012-2014, authorities in the two countries said Wednesday.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/at-least-seven-arrested-in-germany-and-sweden-on-s/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Strike kills family as Israeli evacuation order sparks panicked flight from southern Gaza city\n","publishedAt":"Wed, 03 Jul 2024 06:04:55 -0400","description":"The Hamdan family -- around a dozen people from three generations -- fled their home in the middle of the night after the Israeli military ordered an evacuation from the southern Gaza city of Khan Younis.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/airstrike-kills-family-as-israeli-evacuation-order/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Taiwan says it was warned by China to not interfere in the detention of Taiwanese boat crew\n","publishedAt":"Wed, 03 Jul 2024 05:50:35 -0400","description":"Taiwan said Wednesday that China warned Taiwan's coast guard against interfering in the detention of a Taiwanese fishing boat, in what is seen as Beijing's latest attempt to encroach on Taiwanese territory.\n","Publisher":"washingtontimes","url":"https://www.washingtontimes.com/news/2024/jul/3/taiwan-china-warned-coast-guard-to-not-interfere-i/?utm_source=RSS_Feed\u0026utm_medium=RSS"},{"title":"Chris Mason: We stand on the threshold of a landmark election","publishedAt":"Wed, 03 Jul 2024 00:34:22 GMT","description":"The Tories are braced for defeat, as Labour prepares for victory but polling day could still bring surprises.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/ckdgxj8v75no"},{"title":"World's oldest cave art found showing humans and pig","publishedAt":"Wed, 03 Jul 2024 15:00:35 GMT","description":"The oldest example of cave art has been discovered on an Indonesian island and dated back 51,200 years.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c0vewjq4dxwo"},{"title":"Cavendish breaks Tour de France stage record","publishedAt":"Wed, 03 Jul 2024 15:42:31 GMT","description":"Briton Mark Cavendish claims the outright Tour de France stage win record by taking his 35th victory to surpass Eddy Merckx on stage five in Saint Vulbas.","Publisher":"bbc","url":"https://www.bbc.com/sport/cycling/articles/c2q05e2e920o"},{"title":"Only far right can win majority, warns French PM","publishedAt":"Wed, 03 Jul 2024 14:25:21 GMT","description":"French Prime Minister Gabriel Attal urges voters to stop Marine Le Pen's party winning Sunday's vote.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cd160dywp02o"},{"title":"Where has the UK's summer gone?","publishedAt":"Wed, 03 Jul 2024 09:15:38 GMT","description":"It's been a return to cooler and wetter weather following late June's spell of heat. Can we expect the return of anything warmer soon?","Publisher":"bbc","url":"https://www.bbc.com/weather/articles/ce93lqqev9lo"},{"title":"Water firms could be sued over sewage after ruling","publishedAt":"Wed, 03 Jul 2024 15:08:53 GMT","description":"Owners of adjacent waterways or even members of the public could now bring action over sewage pollution.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cv2gmx8d51xo"},{"title":"Biden blames jet lag and travel for poor debate performance","publishedAt":"Wed, 03 Jul 2024 00:20:41 GMT","description":"The president's comments come after a first Democrat in Congress called for him to withdraw from the election.\n\n","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c4ngx67qle6o"},{"title":"Captain Tom's daughter disqualified from charity ","publishedAt":"Wed, 03 Jul 2024 16:24:40 GMT","description":"The family of the late fundraising veteran say they have made the \"difficult decision\" not to appeal.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cy79q7ej49yo"},{"title":"Children scream in excitement after spotting humpback whale","publishedAt":"Wed, 03 Jul 2024 08:44:35 GMT","description":"The whale was spotted as the schoolchildren were returning from a trip to Sark.","Publisher":"bbc","url":"https://www.bbc.com/news/videos/cn09gjz4q7lo"},{"title":"Gazans seek shelter as Khan Younis exodus continues","publishedAt":"Wed, 03 Jul 2024 12:31:23 GMT","description":"Palestinians continue to stream out of eastern Khan Younis in response to Israeli evacuation orders.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c6p2wevpg7yo"},{"title":"Who should I vote for and what are the parties promising?","publishedAt":"Wed, 03 Jul 2024 08:01:44 GMT","description":"Explore the manifestos of the main parties in England, Scotland, Wales and Northern Ireland and compare their policies on key issues with this interactive guide. ","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cxeez8271nvo"},{"title":"How do the parties compare?","publishedAt":"Wed, 03 Jul 2024 16:12:34 GMT","description":"How do people say they will vote in the UK general election? Our poll tracker measures the trends.","Publisher":"bbc","url":"https://www.bbc.co.uk/news/uk-politics-68079726"},{"title":"Photo ID, polling stations, and postal votes: A simple guide","publishedAt":"Wed, 03 Jul 2024 09:15:04 GMT","description":"The UK general election is on Thursday, 4 July, but there are reports some postal votes have been delayed.","Publisher":"bbc","url":"https://www.bbc.co.uk/news/uk-politics-62064552"},{"title":"Find out who's standing in your area","publishedAt":"Wed, 03 Jul 2024 16:12:55 GMT","description":"Find out which constituency you are in, who you can vote for and where you can vote using our postcode search.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cw55nk6yn01o"},{"title":"What photo ID will you need to vote in the general election?","publishedAt":"Wed, 03 Jul 2024 09:09:10 GMT","description":"Everyone voting in person at the general election on 4 July will have to show valid photo ID.","Publisher":"bbc","url":"https://www.bbc.co.uk/news/explainers-64877005"},{"title":"Who can I vote for in the general election?","publishedAt":"Wed, 03 Jul 2024 16:12:55 GMT","description":"Find out which constituency you are in, who you can vote for and where you can vote using our postcode search.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cw55nk6yn01o"},{"title":"A simple guide to the 4 July general election","publishedAt":"Wed, 03 Jul 2024 09:15:04 GMT","description":"The UK general election is on Thursday, 4 July, but there are reports some postal votes have been delayed.","Publisher":"bbc","url":"https://www.bbc.co.uk/news/uk-politics-62064552"},{"title":"What photo ID will you need to vote?","publishedAt":"Wed, 03 Jul 2024 09:09:10 GMT","description":"Everyone voting in person at the general election on 4 July will have to show valid photo ID.","Publisher":"bbc","url":"https://www.bbc.co.uk/news/explainers-64877005"},{"title":"Hurricane Beryl: Record-breaking sign of warming world","publishedAt":"Wed, 03 Jul 2024 12:23:17 GMT","description":"Beryl is the earliest category five Atlantic hurricane on record, fuelled by exceptional sea warmth.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c9r3g572lrno"},{"title":"A Bugatti car, a first lady and the fake stories aimed at Americans","publishedAt":"Wed, 03 Jul 2024 00:49:10 GMT","description":"A former US police officer runs an AI-powered network of misleading news sites turning its sights towards November.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c72ver6172do"},{"title":"What we know about the India crush that killed 121","publishedAt":"Wed, 03 Jul 2024 09:57:14 GMT","description":"The incident that took place during a religious gathering is among the deadliest crushes in India in a decade.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cyr7kjvme44o"},{"title":"What the main parties are saying about disability","publishedAt":"Wed, 03 Jul 2024 01:34:40 GMT","description":"With 16 million disabled people in the UK, what are the main political parties offering? ","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c9e9r5lm311o"},{"title":"What will the election mean for North Sea oil?","publishedAt":"Wed, 03 Jul 2024 05:23:20 GMT","description":"Political parties are offering substantially different policies for the future of Scotland's oil and gas. ","Publisher":"bbc","url":"https://www.bbc.com/news/articles/crgl32zjpwdo"},{"title":"Five reasons to be positive about England","publishedAt":"Wed, 03 Jul 2024 05:06:06 GMT","description":"BBC Sport takes a look at five reasons to be positive about England's Euro 2024 chances after they reached the quarter-finals.","Publisher":"bbc","url":"https://www.bbc.com/sport/football/articles/cxx2n1y3xzro"},{"title":"'Why football at Euros is different to what we're used to'","publishedAt":"Wed, 03 Jul 2024 06:01:18 GMT","description":"BBC Sport columnist Nedum Onuoha explains why Euro 2024 is not bringing out the best versions of the top teams and star players.","Publisher":"bbc","url":"https://www.bbc.com/sport/football/articles/cz5r38x6ky6o"},{"title":"Police investigate after mum admits ending life of terminally ill son","publishedAt":"Wed, 03 Jul 2024 14:06:55 GMT","description":"Police say they are looking into reports relating to \"an apparent case of assisted dying\" in 1981.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cn33z53pv3vo"},{"title":"Greece starts six-day working week for some industries","publishedAt":"Wed, 03 Jul 2024 11:25:50 GMT","description":"The country says the policy will help boost economic growth.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/czd9g7yzn4jo"},{"title":"Sperm donor says Netflix series is misleading","publishedAt":"Wed, 03 Jul 2024 10:44:54 GMT","description":"Jonathan Jacob Meijer is the subject of a new documentary titled The Man With 1,000 Kids.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c725w322q19o"},{"title":"Cameroon president's daughter hints at same-sex relationship","publishedAt":"Wed, 03 Jul 2024 15:12:01 GMT","description":"Homosexual acts are outlawed in the county and carry punishments of up to five years in jail.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cj7dnm3elkdo"},{"title":"Ex-Post Office chair denies hiding key Horizon report","publishedAt":"Wed, 03 Jul 2024 16:20:33 GMT","description":"Tim Parker says he did not share a report with the Post Office board following advice from lawyers. ","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cyr7kz30jnpo"},{"title":"Husband who put body in suitcase guilty of murder","publishedAt":"Wed, 03 Jul 2024 15:53:05 GMT","description":"Aminan Rahman choked Suma Begum before putting her into a suitcase and dumping it in a river.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cn054dpp57eo"},{"title":"Suspected hit-woman arrested in Armenia","publishedAt":"Wed, 03 Jul 2024 13:33:26 GMT","description":"Aimee Betro is taken into custody after being found near the country's capital, police say.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c87rjzx1r27o"},{"title":"Cavendish breaks Tour de France stage record","publishedAt":"Wed, 03 Jul 2024 15:42:31 GMT","description":"Briton Mark Cavendish claims the outright Tour de France stage win record by taking his 35th victory to surpass Eddy Merckx on stage five in Saint Vulbas.","Publisher":"bbc","url":"https://www.bbc.com/sport/cycling/articles/c2q05e2e920o"},{"title":"Toney 'annoyed' at lack of Euro 2024 game time","publishedAt":"Wed, 03 Jul 2024 14:50:59 GMT","description":"England striker Ivan Toney admits he was 'annoyed' at being brought on on injury time against Slovakia insists he will 'take my opportunity when I get it'.","Publisher":"bbc","url":"https://www.bbc.com/sport/football/articles/cn08gewyxy8o"},{"title":"Kartal's 'dream' Wimbledon run goes on ","publishedAt":"Wed, 03 Jul 2024 14:57:35 GMT","description":"Britain's Sonay Kartal moves into the third round of Wimbledon with a hard-fought victory over Clara Burel in three sets.","Publisher":"bbc","url":"https://www.bbc.com/sport/tennis/videos/cpv3zvn4k3ko"},{"title":"Former England and Bath coach Rowell dies","publishedAt":"Wed, 03 Jul 2024 13:54:10 GMT","description":"Jack Rowell, described by his club as \"a unique character who will never be equalled\", dies at the age of 87.","Publisher":"bbc","url":"https://www.bbc.com/sport/rugby-union/articles/cn09grz3qgwo"},{"title":"Briton Kartal secures third-round Gauff meeting","publishedAt":"Wed, 03 Jul 2024 15:59:18 GMT","description":"Sonay Kartal becomes the first Briton to reach Wimbledon's third round,  producing the biggest win of her career against Clara Burel.","Publisher":"bbc","url":"https://www.bbc.com/sport/tennis/articles/cjm90m8801eo"},{"title":"Mum admits ending life of terminally ill son","publishedAt":"Wed, 03 Jul 2024 14:06:55 GMT","description":"Police say they are investigating reports relating to \"an apparent case of assisted dying\" in 1981.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cn33z53pv3vo"},{"title":"Jeffrey Donaldson sent for trial on sex offence charges","publishedAt":"Wed, 03 Jul 2024 11:11:17 GMT","description":"The ex-MP is charged with rape, four counts of gross indecency and 13 counts of indecent assault.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/cql8qyqlj2eo"},{"title":"Scotland result on 'knife-edge' on eve of election","publishedAt":"Wed, 03 Jul 2024 11:39:39 GMT","description":"Scottish party leaders are making their final pitches to voters ahead of Thursday's UK-wide ballot.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/c4ngpedenz7o"},{"title":"Final day of campaign in Wales as Starmer visits","publishedAt":"Wed, 03 Jul 2024 11:11:47 GMT","description":"Sir Keir Starmer visits Carmarthenshire for the Labour leader's final day of campaigning.","Publisher":"bbc","url":"https://www.bbc.com/news/articles/czd9g7xnex4o"},{"title":" Election outcomes won't change its Ukraine support, says the UN General Assembly's president","publishedAt":"Wed, 03 Jul 2024 11:58:41 -0400","description":"The president of the U.N. General Assembly says it will keep standing up for Ukraine\u0026rsquo;s territorial integrity and sovereignty whatever the outcome of national elections across the globe this year, adding that no country has the right to invade another one","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/election-outcomes-change-ukraine-support-general-assemblys-president-111647960"},{"title":" Italy appeals court upholds conviction of 2 Americans in death of a Rome police officer but reduces sentences","publishedAt":"Wed, 03 Jul 2024 11:50:01 -0400","description":"Italy appeals court upholds conviction of 2 Americans in death of a Rome police officer but reduces sentences","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/italy-appeals-court-upholds-conviction-2-americans-death-111647293"},{"title":" Greece's governing center-right party evicts lawmaker after airport altercation over flight boarding","publishedAt":"Wed, 03 Jul 2024 11:33:52 -0400","description":"Greece\u0026rsquo;s governing center-right party has booted out a lawmaker and former minister who allegedly manhandled an airport worker in a failed bid to board a domestic flight he\u0026rsquo;d turned up late for","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/greeces-governing-center-party-evicts-lawmaker-after-airport-111645539"},{"title":" Turkmenistan and Iran sign deal to supply gas to Iraq. Iran will build pipeline to aid delivery","publishedAt":"Wed, 03 Jul 2024 11:26:14 -0400","description":"Turkmenistan and Iran have signed a contract for the delivery of 10 billion cubic meters a year of Turkmen gas that Iran will then ship on to Iraq","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/turkmenistan-iran-sign-deal-supply-gas-iraq-iran-111645927"},{"title":" Italian Premier Meloni rebukes the youth wing of her far-right party for glorifying fascism","publishedAt":"Wed, 03 Jul 2024 11:50:31 -0400","description":"Italian Premier Giorgia Meloni has admonished the youth wing of her far-right Brothers of Italy after an Italian news outlet published videos showing some of its members glorifying fascism","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/italian-premier-meloni-rebukes-youth-wing-party-glorifying-111645316"},{"title":" Renowned Nazi hunter in France advises Jews to choose far right over far left in elections","publishedAt":"Wed, 03 Jul 2024 11:18:34 -0400","description":"France\u0026rsquo;s renowned Nazi hunter Serge Klarsfeld is advising voters in Sunday\u0026rsquo;s parliamentary elections that if they\u0026rsquo;re faced with a duel between Marine Le Pen\u0026rsquo;s far-right National Rally and a far-left competitor, they should choose the far right","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/renowned-nazi-hunter-france-advises-jews-choose-left-111645318"},{"title":" Polish man charged in Denmark over assault on prime minister Frederiksen","publishedAt":"Wed, 03 Jul 2024 11:10:53 -0400","description":"A Polish man has been charged with assaulting Danish Prime Minister Mette Frederiksen last month, his lawyer said","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/polish-man-charged-denmark-assault-prime-minister-frederiksen-111645314"},{"title":" Roadside bomb kills former Pakistani senator, 2 others in northwest Pakistan: Police","publishedAt":"Wed, 03 Jul 2024 11:01:42 -0400","description":"Police say a former senator in Pakistan has been killed when a vehicle carrying him and supporters struck a roadside bomb in a former stronghold of the Pakistani Taliban near the Afghan border","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/police-roadside-bomb-killed-former-pakistani-senator-2-111643912"},{"title":" Bulgarian Parliament rejects new government proposed by leader of main party","publishedAt":"Wed, 03 Jul 2024 10:38:01 -0400","description":"Bulgaria\u0026rsquo;s Parliament has voted down a minority government proposed by the center-right GERB party, which likely will bring the country closer to new elections","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/bulgarian-parliament-rejects-new-government-proposed-leader-main-111643379"},{"title":" China is the runaway leader in generative AI patent applications followed by the US, the UN says","publishedAt":"Wed, 03 Jul 2024 10:38:15 -0400","description":"The U.N. intellectual property agency says China has requested far more patents than any other country when it comes to generative AI, with the United States a distant second","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/china-runaway-leader-generative-ai-patent-applications-us-111643469"},{"title":" Japan's top court orders government to compensate disabled people forced to undergo sterilization","publishedAt":"Wed, 03 Jul 2024 10:22:15 -0400","description":"In a landmark decision, Japan\u0026rsquo;s Supreme Court has ordered the government to pay suitable compensation to about a dozen victims who were forcibly sterilized under a now-defunct Eugenics Protection Law that was designed to eliminate offspring of people w...","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/japans-top-court-orders-government-compensate-disabled-people-111642885"},{"title":" Indonesia dismisses its chief election commissioner over sexual assault","publishedAt":"Wed, 03 Jul 2024 11:02:17 -0400","description":"Indonesia\u0026rsquo;s electoral commission has fired its chairman after finding him guilty of sexual assault following a complaint by an employee","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/indonesia-dismisses-chief-election-commissioner-sexual-assault-111642884"},{"title":" Arrest warrant lifted for Maddie McCann suspect, but he will stay in prison for other conviction","publishedAt":"Wed, 03 Jul 2024 10:14:28 -0400","description":"An arrest warrant for a man who is also a suspect in the disappearance of British toddler Madeleine McCann has been lifted by a German court in an ongoing trial over several unrelated sexual offenses he is alleged to have committed in Portugal between ...","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/arrest-warrant-lifted-maddie-mccann-suspect-stay-prison-111642249"},{"title":" Extremists attack a wedding ceremony in Mali and kill at least 21","publishedAt":"Wed, 03 Jul 2024 10:13:51 -0400","description":"Residents say an armed group attacked a wedding ceremony in central Mali and killed at least 21 people","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/extremists-attack-wedding-ceremony-mali-kill-21-111641920"},{"title":" Italy appeals court upholds conviction of 2 Americans in death of policeman but reduces sentences","publishedAt":"Wed, 03 Jul 2024 11:58:25 -0400","description":"An Italian appeals court has upheld the convictions of two American men in the slaying of an Italian plainclothes police officer during a botched sting operation but reduced their sentences","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/italy-appeals-court-rule-fate-2-americans-2019-111641732"},{"title":" EU commission approves Lufthansa purchase of long-troubled Italian airline ITA, with conditions","publishedAt":"Wed, 03 Jul 2024 09:58:18 -0400","description":"The European Commission has approved Lufthansa\u0026rsquo;s takeover of Italian airline ITA with conditions to protect competition","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/eu-commission-approves-lufthansa-purchase-long-troubled-italian-111641730"},{"title":" Israeli strike kills another senior Hezbollah commander as diplomats scramble for calm in Lebanon","publishedAt":"Wed, 03 Jul 2024 12:06:16 -0400","description":"An Israeli strike in southern Lebanon has killed a senior Hezbollah commander as tensions continue to boil","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/israeli-strike-kills-senior-hezbollah-commander-diplomats-scramble-111641452"},{"title":" The big bet on the UK election is not who will be prime minister","publishedAt":"Wed, 03 Jul 2024 10:30:18 -0400","description":"Britain's general election is a big event for political gamblers","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/big-bet-uk-election-prime-minister-111641271"},{"title":" AP PHOTOS: Voters will deliver judgment on Conservative government in UK national election","publishedAt":"Wed, 03 Jul 2024 09:34:27 -0400","description":"\nVoters in the United Kingdom will cast ballots in a national election on Thursday, passing judgment on British Prime Minister Rishi Sunak\u0026rsquo;s 20 months in office \u0026mdash; and the four Conservative prime ministers before him. Polls, commentators and politicians all suggest that the left-of-center opposition Labour Party has a strong lead over the Conservatives, who have been in power for 14 years. ","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/ap-photos-voters-deliver-judgment-conservative-government-uk-111640742"},{"title":" South African police find body of former high jump world champ Freitag, who was shot","publishedAt":"Wed, 03 Jul 2024 11:34:16 -0400","description":"Media reports say South African police have discovered the body of former high jump world champion Jacques Freitag after he went missing last month","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/south-african-police-find-body-former-high-jump-111639751"},{"title":" Russian missiles and drones strike eastern Ukraine's Dnipro in an attack that kills 5","publishedAt":"Wed, 03 Jul 2024 09:13:12 -0400","description":"Authorities say a Russian missile and drone attack on the eastern Ukrainian city of Dnipro has killed five civilians and injured 47 others","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/russian-missiles-drones-strike-eastern-ukraines-dnipro-daylight-111640109"},{"title":" Tunisia sets elections for October. The increasingly authoritarian president hasn't said he'll run","publishedAt":"Wed, 03 Jul 2024 09:34:16 -0400","description":"Tunisia\u0026rsquo;s increasingly authoritarian leader has scheduled the next presidential election for October without saying whether he will seek a second term","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/tunisia-sets-elections-october-increasingly-authoritarian-president-run-111640113"},{"title":" The Belarus president says some seriously ill political prisoners will be released","publishedAt":"Wed, 03 Jul 2024 09:02:20 -0400","description":"President Alexander Lukashenko of Belarus said he will release some seriously ill political prisoners who were jailed during protests against his authoritarian rule in 2020","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/belarus-president-ill-political-prisoners-released-111639556"},{"title":" New Dutch leader pledges to cut immigration; opposition vows to root out racists","publishedAt":"Wed, 03 Jul 2024 09:30:06 -0400","description":"Dutch Prime Minister Dick Schoof is pledging to work hard at cutting immigration, one of his new goverment\u0026rsquo;s main aims","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/new-dutch-leader-pledges-cut-immigration-opposition-vows-111639165"},{"title":" Thousands pay respects to renowned Albanian writer Ismail Kadare at his state funeral","publishedAt":"Wed, 03 Jul 2024 09:38:45 -0400","description":"Thousands of people have paid their last respects to Ismail Kadare in a state funeral in Tirana Wednesday, with a minute\u0026rsquo;s silence held nationwide in memory of the renowned Albanian novelist and poet who died earlier this week","Publisher":"abc","url":"https://abcnews.go.com/International/wireStory/thousands-pay-respects-renowned-albanian-writer-ismail-kadare-111639155"},{"title":"Michelle Obama would beat Donald Trump in 2024, a new poll finds","publishedAt":"2024-07-03T13:19:35Z","description":"Michelle Obama would beat Donald Trump in 2024, a new poll findsElections\n\n","Publisher":"usatoday","url":"/story/news/politics/elections/2024/07/03/michelle-obama-would-beat-trump/74289680007/"},{"title":"Fearing the end of democracy this July 4th? You're not alone.","publishedAt":"2024-07-03T12:54:18Z","description":"Fearing the end of democracy this July 4th? You're not alone.Health and Wellness\n\n","Publisher":"usatoday","url":"/story/life/health-wellness/2024/07/03/fourth-of-july-biden-trump/74277333007/"},{"title":"Cape Cod residents 'heartbroken' by dolphin deaths","publishedAt":"2024-07-03T12:46:56Z","description":"Cape Cod residents 'heartbroken' by dolphin deathsNation\n\n","Publisher":"usatoday","url":"/story/news/nation/2024/07/03/cape-cod-dolphin-stranding-community-shaken/74278886007/"},{"title":"Where's Jill Biden? She needs to tell Joe it's time to go.","publishedAt":"2024-07-03T08:05:26Z","description":"Where's Jill Biden? She needs to tell Joe it's time to go.Columnists\n\n","Publisher":"usatoday","url":"/story/opinion/columnist/2024/07/03/replace-biden-debate-jill-biden-intervention/74271430007/"},{"title":"Newport Beach shooting leaves 1 dead, police chase follows: Reports","publishedAt":"2024-07-03T02:53:11Z","description":"Newport Beach shooting leaves 1 dead, police chase follows: ReportsNation\n\n","Publisher":"usatoday","url":"/story/news/nation/2024/07/02/fashion-island-mall-shooting-newport-beach/74287246007/"},{"title":"Spoiled food causes Delta flight to make emergency NYC landing","publishedAt":"2024-07-03T13:30:35Z","description":"Spoiled food causes Delta flight to make emergency NYC landingAirline News\n\n","Publisher":"usatoday","url":"/story/travel/airline-news/2024/07/03/delta-flight-emergency-landing-spoiled-food/74288805007/"},{"title":"Ants perform limb amputations that 'rival' those of humans","publishedAt":"2024-07-03T15:18:13Z","description":"Ants perform limb amputations that 'rival' those of humansNation\n\n","Publisher":"usatoday","url":"/story/news/nation/2024/07/03/carpenter-ants-limb-amputations/74289562007/"},{"title":"What does the American flag symbolize?","publishedAt":"2024-07-03T10:12:04Z","description":"What does the American flag symbolize?Politics\n\n","Publisher":"usatoday","url":"/story/news/politics/2024/07/03/sacrifice-and-skepticism-how-americans-view-american-flag-symbolism-meaning/74288760007/"},{"title":"Melissa Etheridge's daughter found new siblings from the late David Crosby","publishedAt":"2024-07-03T01:28:22Z","description":"Melissa Etheridge's daughter found new siblings from the late David CrosbyCelebrities\n\n","Publisher":"usatoday","url":"/story/entertainment/celebrities/2024/07/02/melissa-etheridge-david-crosby-sperm-donor-children/74286908007/"}]